{"pageProps":{"post":{"id":"239","date":"2010. 2. 2. 18:30","title":"Google에서 온 메일 (IE6를 비롯한 older Browser 지원중단안내)","content":"구글 App을 쓰고 있는데 오늘 재미있는 메일이 와서 함께 공유해봅니다.<br>\n영어로 되어 있어서 ^^; 대충만 읽어 요지를 제대로 파악했는지는 모르겠지만 <br>\n\"IE6과 같은 나이많은 브라우저들은 HTML5에서 제공하는 기능, 빠른 Javascript 처리가 안되기 때문에<br>\n좋은 품질의 웹 서비스를 제공하기 위해서 브라우저 지원을 중단하고 업그레이드 안내를 할 것이다\" 라는 내용입니다.<br>\n<br>구글이 지원하는 브라우저는 다음과 같은데 Chrome 4.0 이상이랍니다. 3.0도 과감하게 버린 것에 놀랐습니다.<br>\nInternet Explorer 7.0 and above, Firefox 3.0 and above, Google Chrome 4.0 and above, and Safari 3.0 and above<br>\n<br>바람이 있다면 HTML5 를 위해 모든 사람들이 브라우저 업그레이드를 했으면 좋겠습니다.<br>\n그리고, Mozilla와 Safari 의 video 지원이 통일되었으면 좋겠어요. ogg든 mp4든.. :)<br>\n<br><br>\n<br>* 다음은 메일 원문입니다.<br>\n<br><span style=\"font-weight: bold;\">Important notice: Google Apps browser support</span><br>\n<br>Dear Google Apps admin,​<br>\n<br>\nIn order to continue to improve our products and deliver more\nsophisticated features and performance, we are harnessing some of the\nlatest improvements in web browser technology. This includes faster\nJava-Script processing and new standards like HTML5. As a result, over\nthe course of 2010, we will be phasing out support for Microsoft\nInternet Explorer 6.0 ​as well as other older browsers that are not\nsupported by their own manufacturers.<br>\n<br>\nWe plan to begin phasing out support of these older browsers on the\nGoogle Docs suite and the Google Sites editor on March 1, 2010. After\nthat point, certain functionality within these applications may have\nhigher latency and may not work correctly in these older browsers.\nLater in 2010, we will start to phase out support for these browsers\nfor Google Mail and Google Calendar.<br>\n<br>\nGoogle Apps will continue to support Internet Explorer 7.0 and above,\nFirefox 3.0 and above, Google Chrome 4.0 and above, and Safari 3.0 and\nabove.<br>\n<br>\nStarting this week, users on these older browsers will see a message in\nGoogle Docs and the Google Sites editor explaining this change and\nasking them to upgrade their browser. We will also alert you again\ncloser to March 1 to remind you of this change.<br>\n<br>\nIn 2009, the Google Apps team delivered more than 100 improvements to\nenhance your product experience. We are aiming to beat that in 2010 and\ncontinue to deliver the best and most innovative collaboration products\nfor businesses.<br>\n<br>\nThank you for your continued support!<br>\n<br>\nSincerely,<br>\n<br>\nThe Google Apps team<br>\n<br>\n<br>\nEmail preferences: You have received this mandatory email service\nannouncement to update you about important changes to your Google Apps\nproduct or account.<br>\n<br>\nGoogle Inc.<br>\n1600 Amphitheatre Parkway<br>\nMountain View, CA 94043\n\t\t<br>\n<br>            ","summary":"구글 App을 쓰고 있는데 오늘 재미있는 메일이 와서 함께 공유해봅니다.\n영어로 되어 있어서 ^^; 대충만 읽어 요지를 제대로 파악했는지는 모르겠지만 \n\"IE6과 같은 나이많은 브라우저들은 HTML5에서 제공하는 기능, 빠른 Javascript 처리가 안되기 때문에\n좋은 품질의 웹 서비스를 제공하기 위해서 브라우저 지원을 중단하고 업그레이드 안내를 할 것이다\" 라는 내용입니다.\n구글이 지원하는 브라우저는 다음과 같은데 Chrome 4.0 이상이랍니다. ","image":"https://t1.daumcdn.net/tistory_admin/static/images/openGraph/opengraph.png"}},"__N_SSG":true}