{"pageProps":{"post":{"id":"351","date":"2012. 3. 1. 23:58","title":"나에게 Mac은 안 맞는 것 같아.","content":"예전에 <a href=\"http://blog.joostory.net/65\" target=\"_blank\" title=\"[http://blog.joostory.net/65]로 이동합니다.\">Ubuntu를 쓰는 이유는 자유로운 기분때문</a>이라고 했던 기억이 있는데 (예전 글이라 그런지 다시 읽어보니 손발이 오그라드네) 사실 Ubuntu를 쓰는 이유라기보다는 Windows를 안쓰는 이유라고 하는게 더 알맞을 것 같다.&nbsp;Windows가 싫은 이유를 장황하게 나열했지만 요약해서 말하자면 \"MS가 하는 짓이 미워서\"다.<br>\n<br>시간이 흘러 이제 Windows는 테스트할때나 ActiveX써야할때만 VirtualBox로 볼 수 있는 녀석이 되었고, 눈에 안보이다보니 이젠 Ubuntu와 Mac이 비교가 되기 시작한다. 회사 메인 개발 PC에서 사용하는 Ubuntu, 역시 회사와 이동 중, 집에서 사용하는 Mac.<br>\n<br>Mac은 뭐랄까... '아름다움' 이라고 하면 사용하는 이유로 충분할 것 같다. 기계와 OS의 시각적인 아름다움도 있지만 UX적인 아름다움도 있다. 비교적 프로그램 설치방법이 단순하고 삭제도 단순. 파일을 직접 관리를 하기보다는 검색을 하게 하거나 문서,사진 관리 앱을 통해서 파일이 아닌 문서, 사진으로 관리하게 하는 등. 어찌 생각해보면 진정한 PC라는 생각이 들만한 \"아름다운\" 기계라 할 수 있다.<br>\n<br>근데 사진관리앱(내 경우엔 iPhoto)을 벗어나게 되자 그 \"아름다움\"이 완전히 무너지기 시작했다. (문서 관리 앱은 원래 사용안했다. 문서는 워낙 MS Office 쪽 문서가 많은터라 파일로 관리할 수밖에 없다.) 사진관리앱을 벗어난 사진들은 Finder에서 떠돌기 시작했다. 게다가 Finder는 아무리 익숙해지려해도 익숙해지기 쉽지가 않다. 어느 순간 게임만 하던 bootcamp Windows에서 파일을 관리하고 있음을 알게 되었다. 맥북에서 bootcamp Windows를 파일관리하는 용도로 쓰고 있다니... 맥 팬보이가 들었다면 불같이 화를 냈을 상황이다. 그런데 어쩌나? 더 편한걸. 탐색기는 너무 편한걸... ㅠ_ㅠ Ubuntu에서는 nautilus가 탐색기와 비슷한 기능을 제공했기때문에 불편이 없었던 것 같다.<br>\n<br>또 익숙해지지 않는 키보드 사용성도 문제다.<br>\n'Command + &lt;-' 의 조합은 언제쓸까? 바로 문서편집기에서 커서를 줄 젤 앞으로 옮기는 단축키다. 그리고 웹브라우저에서는 이전 페이지로 돌아가는, 즉 history.back을 하는 단축키다. 그렇다면 웹브라우저 에디터에서 'Command + &lt;-'를 누른다면? 어떻게 될지는... 해봐야안다는거다. 대부분 에디터 이벤트로 처리되겠지만 이따금씩 history 이벤트로 처리된다. 그러면 쓰던 글을 모두 날리게 된다. 이거 은근히 신경쓰인다.<br>\n<br><br>\n어쨌든 Mac은 나에게 안 맞는 것 같다. Ubuntu가 내게 맞는 것 같다.<br>\n내 Desktop은 (구입을 고민 중이지만) iMac이 아닌 조립PC로 결정이다.<br>\n<br>끄읕.            ","summary":"예전에 Ubuntu를 쓰는 이유는 자유로운 기분때문이라고 했던 기억이 있는데 (예전 글이라 그런지 다시 읽어보니 손발이 오그라드네) 사실 Ubuntu를 쓰는 이유라기보다는 Windows를 안쓰는 이유라고 하는게 더 알맞을 것 같다.&nbsp;Windows가 싫은 이유를 장황하게 나열했지만 요약해서 말하자면 \"MS가 하는 짓이 미워서\"다.\n시간이 흘러 이제 Windows는 테스트할때나 ActiveX써야할때만 VirtualBox로 볼 수 있는 녀석이 되었고","image":"https://t1.daumcdn.net/tistory_admin/static/images/openGraph/opengraph.png"}},"__N_SSG":true}