{"pageProps":{"post":{"id":"381","date":"2015. 7. 7. 00:51","title":"티스토리의 미래","content":"<p>티스토리의 미래를 그려본다. 내가 그린다고 그대로 되는 것도 아니지만 그냥 그려본다.<br><br>네이버 블로그는 이웃을 많이 밀고 있다. Social의 시대이기에 당연하다. 최근에 생긴 글쓰는 플랫폼에서 follow 개념이 없는 플랫폼은 거의 없다. 거의가 아니라 정말 전혀 없다. 티스토리는 없다. 대신 트랙백이라는 것을 통해서 굉장히 연결을 오픈해두었다. 트랙백은 초기에는 아주 인기가 좋았지만 점차 스팸이 날뛰기 시작하자 거의 사용되지 않고 닫아두는 분위기다. 다른 블로그에서 이를 지원하지 않아 그렇기도 하다.<br><br>우리나라의 글쓰기 플랫폼은 거의 정체기에 있었는데 갑자기 플레인, 폴라, 브런치 등이 나와서 사용자를 유혹한다. 이들은 세련된 에디터를 제공한다. 조금만 건드리면 금방 이쁜 글이 나온다. 티스토리는 다음 에디터를 수정해서 사용하고 있다. 굉장히 구닥다리다. 사실 다음 에디터 자체가 그리 좋지는 않았다. 심지어 관리를 중단해서 발전의 여지도 없다.<br><br>티스토리는 우리나라 최초로 UI 모두를 마음대로 수정할 수 있는 CMS로 인기가 높았다. 티스토리 이후에 블로그 서비스는 스킨기능이 크게 강화됐다. 아직 티스토리만큼 자유로운 서비스는 없지만 거의 원하는대로 할 수 있다. 티스토리는 그때 이후로 멈췄다. 잘 나가고 있는 텀블러의 강력한 스킨 제작기능에 비하면 턱없이 부족하다. 티스토리가 주도하던 시대에 더 발전했어야 하는데 아쉽게도 그러질 못했다.<br><br>티스토리는 서로 연결되지도 못하고 글쓰기도 그리 좋지 못하고 스킨도 좋다고 할 수 없는 상태다. 이제 티스토리는 어디로 가야할까? 서로 연결할 수 있도록 follow를 하면 될까? 물론 좋은 생각이지만 현재의 티스토리에 이런걸 넣기엔 너무 티스토리는 연결에 부적합한 구조다. 그래도 했으면 하지만 어떻게 해야 자연스럽게 그렇게 할 수 있을지 지금은 그림이 그려지지 않는다.<br><br>에디터를 강화해서 글 쓰기 좋게 하면 될까? 이건 조금 괜찮다... 라기 보다는 당연히 해야할 것 같은 느낌이다. 글이 쓰기 편해야 글이 쓰고 싶어진다. 글쓰다가 삐걱거리기 시작하면 흐름도 끊어지고 점차 쓰기 싫어진다. 문제는 그동안 이거저거 많이 붙여넣다보니 너무 에디터가 복잡해졌다. 편하게 만든다고 있던 기능을 빼면 사용자가 크게 반발하기 때문에 기능이 빠지는 것에 상응하는 더 좋은 것을 제공해야한다. 일단 지금 html 수정이 가능한 상태이니 건드리지 말고 간편한 글쓰기 모드를 제공하는 건 어떨까 싶다. 예를 들어 markdown 에디터 같은 것.<br><br>스킨 기능 강화는 어떨까? 난 여기에 많이 마음이 간다. 사실 글 쓰기 좋은 에디터는 많다. 그런데 공개된 장소 혹은 정형화된 장소에 적는 글은 내 것이라는 느낌이 덜 하다. 티스토리의 자유로운 스킨은 그 공간 안의 모든 것이 내 것이라는 느낌을 준다. 심지어 custom domain도 제공되기 때문에 기업이 자신의 블로그로 티스토리를 사용하는 경우도 많다. 텀블러같은 강력한 기능을 제공하는건 당장은 어렵겠지만 플러그인을 잘 활용하면 스킨의 소스코드를 직접 건드리지 않고도 제공되는 스킨으로 자신만의 스킨을 만들 수 있을 것이다.<br><br>티스토리는 자신의 웹사이트를 쉽게 만들 수 있는 CMS 도구로서 더 발전할 여지가 있어보인다. 사람들은 좋은 글을 써서 자신의 웹사이트를 더 풍성하게 만들고 티스토리는 이 컨텐츠를 여기저기 활용해볼 수 있어 윈윈할 수 있다. 그저 글쓰기 플랫폼이 아니라 웹사이트 제작 도구로서 발전해야한다.<br><br>뭐부터 먼저 할 수 있을까? 내 마음 속 1순위는 스킨 편집이 좀 더 쉽도록 html/css 코드 에디터를 강화다. 찾아보니 CodeMirror 같은 것을 사용하면 쉽게 할 수 있을 것 같다. 2순위는 markdown 글쓰기이다. 역시 CodeMirror를 사용하면 된다. 게다가 CodeMirror를 사용하면 html을 위한 에디터 제공도 가능하다.<br></p>            ","summary":"티스토리의 미래를 그려본다. 내가 그린다고 그대로 되는 것도 아니지만 그냥 그려본다.네이버 블로그는 이웃을 많이 밀고 있다. Social의 시대이기에 당연하다. 최근에 생긴 글쓰는 플랫폼에서 follow 개념이 없는 플랫폼은 거의 없다. 거의가 아니라 정말 전혀 없다. 티스토리는 없다. 대신 트랙백이라는 것을 통해서 굉장히 연결을 오픈해두었다. 트랙백은 초기에는 아주 인기가 좋았지만 점차 스팸이 날뛰기 시작하자 거의 사용되지 않고 닫아두는 분위기다. 다","image":"https://t1.daumcdn.net/tistory_admin/static/images/openGraph/opengraph.png"}},"__N_SSG":true}