{"pageProps":{"post":{"id":"432","date":"2016. 7. 26. 01:47","title":"익숙함","content":"<p>최근 몇년간 너무나 드라마틱한 일들이 생기면서&nbsp;새롭게 시작한 일들이 많다. 뭐든 처음할 땐 힘이 들고 긴장이 된다. 또&nbsp;잘 모르는 상태다보니 이것저것 공부하고 정리도 많이 한다.</p><p>힘들던 일도 계속 반복하면&nbsp;점점 익숙해지고&nbsp;힘도 덜 들고 긴장도 덜 하게 된다. 그런데 어찌된 일인지 덜 힘들어지고 긴장도 덜하게 되면서 공부도 덜 하게 되고, 정리도 덜 하게 된다. 내가 게으른 탓도 있겠지만 이 익숙함이라는 것이 나를 그렇게 만드는 것 같다.</p><h2>육아일기</h2><p>아이가 태어나고 안식휴가를 쓰면서 <a href=\"http://joo.joohana.net/tagged/%EC%9C%A1%EC%95%84%EC%9D%BC%EA%B8%B0\" target=\"_blank\" class=\"tx-link\">일기 비스무레한 것</a>을 쓰기 시작했다. 몸이&nbsp;너무너무 힘든데도 불구하고&nbsp;그냥 지나가버리기에는 너무나 신기한 일들이 많아서 정리하지 않으면 견딜 수가 없었다.</p><p>일주일 정도는 하루를 돌아보며 정리를 했다. 그런데 익숙해지면 익숙해질수록 글 쓰는 빈도가 점점 줄어들었고 글을 쓰려고 마음먹은 어느 날은 이런 생각도 들었다.</p><blockquote class=\"tx-quote-tistory\"><p>매일 똑같은, 특별할 것도 없는 날이네</p></blockquote><p>지금 생각해보면 그렇지 않았다. 아이의 하루하루는 늘 새로운 시간이었다. 그땐 만성피로에 기계적으로 아이를 돌보는 상태가 되면서 저런 생각을 하게 된 것 같다. 조금 힘들더라도 생각을 정리했으면 지금 읽어볼 좋은 글들이 되었을텐데 아쉽다.</p><h2>요리일기</h2><p>안식휴가 동안 육아와 함께&nbsp;요리도 같이 시작했다. 일기라고 불리기엔 좀 너무 레시피 정리같지만 그래도 <a href=\"http://blog.joostory.net/category/%EC%A7%91%EB%B0%A5\" target=\"_blank\" class=\"tx-link\">요리일기</a> 같은 것도 쓰기시작했다. <a href=\"http://blog.joostory.net/399\" target=\"_blank\" class=\"tx-link\">미역국</a>을 시작으로 내가 평소에 좋아하던 것들을 하나하나 하면서 할 때마다 정리를 했다.</p><p>처음 몇개는 요리 과정마다 하나하나 사진도 찍어가면서 기록을 했는데 시간이 가면 갈수록 마지막 완성사진만 찍게 되었고 심지어는 이런 생각을 하면서 아예 사진을 안찍게 되었다.</p><blockquote class=\"tx-quote-tistory\"><p>하다보니 레시피가 다 비슷비슷하네. 굳이 정리할 필요있나?</p></blockquote><p>그렇긴하다. 음식의 맛이라는 것이 식재료의 특성을 이해하여 그것을 조합하는 것이기 때문에 비슷한 류의 음식은 레시피 없이 대충 '이럴 것이다' 하고 상상하면서 하면 맞을 때도 있다. 그러나 나는 아직 마스터가 아니다. 레시피 없이 만들면 맛이 별로인 경우가 많다. 레시피를 완전히 이해하지 못했기때문이다. 그래서 더 정리해서 내것으로 만들 필요가 있는데 그러질 못한 것이 아쉽다.</p><h2>익숙함</h2><p>익숙해지는 것은 참 좋은 일인데 그 익숙함이 나에게는 게으름을 가져오는 것 같다. 인내심이 부족한 것도&nbsp;이유이겠지만, 익숙해진 그 일을 소중히 여기지 않는 것이 가장 큰 이유같다. 새로운 것만 할 수는 없고 늘 하던 것도 게을러지지 않고 해야하는데 정말 소중한 일이라고 여긴다면 게을러지는 것이 조금이나마 덜 하지 않을까?</p>            ","summary":"최근 몇년간 너무나 드라마틱한 일들이 생기면서&nbsp;새롭게 시작한 일들이 많다. 뭐든 처음할 땐 힘이 들고 긴장이 된다. 또&nbsp;잘 모르는 상태다보니 이것저것 공부하고 정리도 많이 한다.힘들던 일도 계속 반복하면&nbsp;점점 익숙해지고&nbsp;힘도 덜 들고 긴장도 덜 하게 된다. 그런데 어찌된 일인지 덜 힘들어지고 긴장도 덜하게 되면서 공부도 덜 하게 되고, 정리도 덜 하게 된다. 내가 게으른 탓도 있겠지만 이 익숙함이라는 것이 나를 그렇게","image":"https://t1.daumcdn.net/tistory_admin/static/images/openGraph/opengraph.png"}},"__N_SSG":true}