{"pageProps":{"post":{"id":"446","date":"2016. 12. 20. 17:11","title":"요리의 기본","content":"<p>음식 프로그램에서는 대개 음식칭찬만 하기 바쁜데 수요미식회에서는 거침없이 시원한 비판을 하는 분이 있다. 황교익 아저씨다. 처음엔 블로그에서 쓰는 글만 보다가 페이스북도 하시기에 팔로우하고 있다.</p>\n<p>여러가지 잘못 알고 있는 부분을 콕집어 비판을 많이 하는데 천일염과 GMO에 대해서 많이 비판을 했다. 천일염이 굉장히 좋은 것으로 알고 있는데 그렇지 않고, GMO가 굉장히 나쁜 것으로 알고 있는데 그렇지 않다고. 오늘도 천일염에 대해서 비판하는 글을 쓰셨는데 이 내용에 대한 것보다도 공유하신 글이 맘에 들어 이에 대해서 몇자 적어보려한다.</p>\n<iframe src=\"https://www.facebook.com/plugins/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fkyoik.hwang.7%2Fposts%2F1844650495750528&amp;width=500\" width=\"500\" height=\"546\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n\n<h2 id=\"-\">요리의 기본</h2>\n<p>공유된 글은 <a href=\"http://chefnews.kr/archives/10324\">C.I.A.출신 셰프들이 전하는 잊지 말아야 할 요리 기본기 15가지</a>이다. C.I.A.는 익히 아는 미국 중앙정보부가 아니고 <a href=\"https://www.ciachef.edu\">Culinary Institute of America</a>라고 미국에 있는 유명한 요리학교 이름이다. 나도 이 요리학교는 어떤 기자가 이 학교 체험에 대해 쓴 책을 보고 처음 알았다. (무슨 책인지 기억이 나질 않는다)</p>\n<p>그 기자는 C.I.A.에서의 아주 혹독한 수련과정을 자세히 적었는데 수련과정이라는 것이 뭔가를 하나 배우고는 그걸 계속해서 반복해서 완료시간을 줄이는 것이었다. 첫번째 주에는 재료손질만 두번째 주에는 한가지 기본소스 만들기만 하는 식이었다. 글을 보니 갑자기 이 책이 생각났다. 기본기 첫번째가 &#39;칼질을 연습하라&#39;다. 기자가 C.I.A. 수련 첫번째 주동안 내내 한 일이었다.</p>\n<h2 id=\"-\">칼질을 연습하라</h2>\n<p>기자의 책을 보고 나도 칼질을 많이 연습했다. 요즘 이유식을 만들기 때문에 더 많이 하고 있다. 어제도 30분넘게 채썰기를 했다. 연습을 많이 한다고 했지만 아직도 멀었다. 도무지 속도가 빨리 붙지를 않는다. 처음에는 조금 빨라지는 듯했지만 지금은 정체상태다. 아무래도 겁이 많아서 그런 것 같다. 손을 다칠까, 재료가 사방으로 튈까 걱정하다보니 속도가 좀처럼 나질 않는다.</p>\n<h2 id=\"-\">완벽히 준비하라, 모든 재료를 한꺼번에 넣지 마라</h2>\n<p>요리를 시작하면서부터 여기저기서 레시피들을 많이 보고 있는데 주로 동영상이다. 글로 된 레시피는 따라해도 맛을 내기가 쉽지 않았다. 동영상을 보면서 이유를 알았는데 재료를 적절한 시점에 투입하는 것이 맛을 내는데 정말 중요했다. 적절한 시점에 넣기 위해서는 바로 옆에 재료가 준비된 상태로 있어야 한다. 어느 정도 익숙해지면 재료가 준비되어 있지 않아도 그럭저럭 할 수 있지만 처음하는 음식은 반드시 준비해놓아야 맛이 났다.</p>\n<h2 id=\"-1-\">칼을 1년에 한번씩 전문 칼갈이에게 맡겨라</h2>\n<p>칼질을 많이 하다보니 좋은 칼, 좋은 도마에 절로 눈이 간다. 한번은 부모님댁에 갔는데 칼이 너무 잘들어서 깜짝 놀랐다. 그래서 이건 무슨 칼인가 하고 보니 내가 쓰는 칼이랑 비슷한 마트에서 파는 평범한 칼이었다. 이게 어떻게 된건가 하고 여쭤보니 이따금씩 칼갈이에게 맡긴다고 하셨다. 그러면서 나에게도 맡겨보라고 추천해주셨다.</p>\n<p>아직 맡기진 못하고 집에 있는 간이 칼갈이를 사용하고 있지만 언젠간 칼갈이에게 맡겨볼 생각이다. 재료에 닿기만해도 잘릴 정도로 칼이 잘들면 너무너무 기분이 좋다.</p>\n<h2 id=\"-\">집 요리를 먼저 배워라</h2>\n<p>이전까진 관심도 안가졌지만 이젠 부모님댁에 가면 늘 요리를 어떻게 하시는지 관찰하고 여쭤본다. 간단한 음식인 줄 알았는데 굉장히 복잡한 과정을 거치는 경우가 대부분이었다. 빨리빨리 만드실 수 있는 이유는 그만큼 많이 해보셨다는 뜻이리라. 동영상 레시피에서도 알려주는 사람이 자주 하는 말이 &#39;어머니의 방식&#39;, &#39;우리 집의 방식&#39; 이었다. 나도 나중에 요리를 하면서 그런 말을 할 수 있으면 좋겠다.</p>\n<h2 id=\"-\">한 가지 요리를 마스터하라</h2>\n<p>제일 처음 만든 요리는 <a href=\"http://blog.joostory.net/399\">미역국</a>이다. 물론 이전에도 떡볶이같은 간단한 요리는 만들어본 적이 있고 라면에 이것저것 넣어서 먹어본 적은 있지만 요리방법을 익혀서 제대로 만들었다고 할만한 요리는 없었던 것 같다.</p>\n<p>미역국은 사실 산후조리를 위해서 만들어야했기때문에 싫어도 해야했지만 어쨌든 거의 한달동안 미역국을 계속 만들었다. 고기를 넣었다가 안넣었다가, 간장을 이만큼 넣었다가 요만큼 넣었다가, 간장대신 새우젓을 넣었는 등등 여러가지 방법으로 미역국을 만들어봤다. 그랬더니만 이상하게 다른 요리에도 자신이 생겼다. 재료를 다루고 양을 조절하는데 익숙해져서 그런 것 같았다.</p>\n<h2 id=\"-\">바로 바로 정리하라</h2>\n<p>이건 정리가 되어있지 않으면 아무것도 못하는 내 성격때문에 그런 것도 같지만 누가 가르쳐주지 않았는데도 불구하고 자연스럽게 이렇게 됐다. 재료를 다듬어 그릇에 담고 쓰레기와 도마, 칼을 바로 정리한다. 그러고나서 다음재료로 넘어간다. 처음엔 굉장히 많은 시간이 걸렸지만 이제는 시간배분을 할 수 있게 되어서 물이 끓는 것처럼 조금 시간이 걸리는 일을 하는 도중에 정리를 한다. 덕분에 시간은 많이 줄었다.</p>\n<hr>\n<p>이제 익숙해진 몇몇 요리는 레시피를 보지도 않고 계량을 하지도 않고 뚝딱뚝딱 만들어낼 수 있다. 하지만 여전히 시간은 많이 걸리는 편이고 만들 수 있는 요리도 아주 제한적이다. 언제쯤 차승원처럼, 에릭처럼 원하는 요리를 자유자재로 할 수 있게 될지는 모르겠지만 어쨌든 요리가 재미있으니 언젠간 되겠지.</p>\n            ","summary":"음식 프로그램에서는 대개 음식칭찬만 하기 바쁜데 수요미식회에서는 거침없이 시원한 비판을 하는 분이 있다. 황교익 아저씨다. 처음엔 블로그에서 쓰는 글만 보다가 페이스북도 하시기에 팔로우하고 있다.\n여러가지 잘못 알고 있는 부분을 콕집어 비판을 많이 하는데 천일염과 GMO에 대해서 많이 비판을 했다. 천일염이 굉장히 좋은 것으로 알고 있는데 그렇지 않고, GMO가 굉장히 나쁜 것으로 알고 있는데 그렇지 않다고. 오늘도 천일염에 대해서 비판하는 글을 쓰셨는","image":"https://t1.daumcdn.net/tistory_admin/static/images/openGraph/opengraph.png"}},"__N_SSG":true}