{"pageProps":{"post":{"id":"459","date":"2017. 1. 22. 22:48","title":"이케아에 갔다.","content":"<p>토요일 이케아에 갔다. 목적은 현관에서 거실로 이어지는 복도(?)에 둘 수납함을 사기 위해서다.</p>\n<p><img src=\"https://t1.daumcdn.net/cfile/tistory/214BB9335884BA4A06\" alt=\"\"></p>\n<h2 id=\"-\">기억에 남는 일</h2>\n<p>주차장에 들어가기 위해서 대기 중이었는데 앞차에서 비상등이 켜졌고 운전석에서 노랑머리 남자가 내렸다. 황급히 뒷자석 문을 열더니 어린 여자아이의 치마를 올리고 스타킹과 팬티를 무릎까지 내렸다. 그렇게 유치원에 갈법한 나이의 어린 아이는 길가에서 아빠에게 안겨 소변을 봤다. ‘미안해. 눈을 돌리고 쳐다보지 말았어야 했는데 우리 눈이 마주쳤지? 미안해.’</p>\n<p>식사를 하기 위해서 배식대로 향하는데 뒤에 있던 파란 눈의 외국인이 ‘이거 가져가세요’ 라며 쟁반을 건네줫다. 그 분이 아니었다면 우리는 음식을 받아들고서 몹시 당황했을 것이다. 한국인이 한국에서 외국인에게 도움을 받았다. ‘고마워요. 이케아에서 밥 먹는 건 처음이라서요.’</p>\n<p>모든 쇼핑을 완료하고 화장실에 다녀오는 시간을 가졌다. 먼저 나와서 소파에 앉아 기다리다가 방금 화장실에서 나온 아이와 아내를 맞아하려는데 휴대폰이 안보인다. 깜짝 놀라서 지나왔던 길을 돌아가서 기억을 따라가기 시작했다. 휴대폰과 함께 했던 마지막 기억을 좇아가보니 마지막에 앉아있던 소파 앞 휴대폰 충전테이블에 도착했다. 그래 난 무선충전테이블이 신기해서 휴대폰을 거기 꽂아두고서 잊지 않기 위해서 바로 앞 소파에 앉아 기다린 거였지. &#39;머리가 나쁜 건 아닐거야. 몸이 피곤해서 머리도 잠시 쉰거야&#39;</p>\n<p>가방을 잃어버렸다. 휴대폰 사건을 겪은 후 바로 이어지는 일이었다. 설마 트렁크에 넣어두고서 없어졌다고 하는거 아니겠지? 그건 아니었다. 정말 가방이 없어진 거다. 바보같이 화장실 앞 소파에 두고서 차로 와버린게 분명했다. 황급히 돌아갔지만 가방이 없었다. 바로 앞에 있던 직원에게 분실물 관리하는 곳이 있냐고 물어봤다.</p>\n<blockquote>\n<p>혹시 아이물건이 들어있는 가방을 잃어버리셨나요?<br>예! 맞아요.<br>저 끝으로 가셔서 오른쪽에 가시면 찾으실 수 있습니다.</p>\n</blockquote>\n<p>짧은 시간동안 가방은 참 먼 거리를 움직였다. 설명한 그 분이 그렇게 먼 곳까지 가서 맡겨둔 것이겠지. 설명한 곳에 가니 환하게 웃는 직원이 우릴 맞아주었고 가방을 찾을 수 있었다. &#39;누군지 모두 알 수는 없지만 가방을 찾는데 도움 준 모든 분들께 감사합니다.&#39;</p>\n<h2 id=\"-\">좋았던 일</h2>\n<p>이케아에 가구만 있는건 아니다. 주방용품도 어마어마하게 많다. 특히 마음에 든건 다양한 종류의 나무도마들과 이케아 365+ 칼들. 나무 도마는 너무 가볍지도, 무겁지도 않으면서 충분히 크고 품질이 좋았다. 심지어 가격이 너무 싸다. 칼도 마찬가지. 앞으로 칼, 도마는 이케아에서만 사기로 결심했다. ‘사랑해요, 이케아!’</p>\n<h2 id=\"-\">나빴던 일</h2>\n<p>30여분을 기다려서 주차장에 드디어 진입할 수 있었다. 그러나 장애인 주차구역을 제외하고는 주차공간이 없었다. 혹시 나가는 사람이 없는지 눈치를 보여 주차장을 돌아다녀야했다. 주차장안에는 빈공간을 알려주는 숫자와 표시가 있긴 하지만 쩝. 밖에만 신경쓰지말고 안에도 신경 좀 써줬으면 하는 사소한 바램.</p>\n<hr>\n<p>이케아에서 사온 수납함은 아직 차에 있다. 걔는 언제 집에 올 수 있을까 ;;</p>\n            ","summary":"토요일 이케아에 갔다. 목적은 현관에서 거실로 이어지는 복도(?)에 둘 수납함을 사기 위해서다.\n\n기억에 남는 일\n주차장에 들어가기 위해서 대기 중이었는데 앞차에서 비상등이 켜졌고 운전석에서 노랑머리 남자가 내렸다. 황급히 뒷자석 문을 열더니 어린 여자아이의 치마를 올리고 스타킹과 팬티를 무릎까지 내렸다. 그렇게 유치원에 갈법한 나이의 어린 아이는 길가에서 아빠에게 안겨 소변을 봤다. ‘미안해. 눈을 돌리고 쳐다보지 말았어야 했는데 우리 눈이 마주쳤지?","image":"https://img1.daumcdn.net/thumb/R800x0/?scode=mtistory2&fname=https%3A%2F%2Ft1.daumcdn.net%2Fcfile%2Ftistory%2F214BB9335884BA4A06"}},"__N_SSG":true}