{"pageProps":{"post":{"id":"462","date":"2017. 2. 20. 23:42","title":"Electon 시작하기","content":"<p>재미로 시작한 Electron인데 어쩌다보니 세미나까지 하게 되었다. 파트 개발자 모임을 활성화하려고 하는데 시작할 계기를 만들어야 했고 때마침 내가 왜 그랬는지 모르겠지만 Electron으로 세미나를 하겠다고 했다. 다음블로그 api를 사용해서 지금 글을 쓰고 있는 티스토리 에디터 같은 것을 만드는 과정을 설명하면 되겠다고 이야기를 꺼냈다가 하는 것으로 결정되어 버렸다. 사실 나도 <a href=\"http://blog.joostory.net/461\">지금까지 알게된 것들을 정리해보고 싶었기도 했기에</a> 이참에 정리를 해보는 것도 좋겠다고 생각했다.</p>\n<h2 id=\"-\">앱 준비</h2>\n<p>먼저 앱을 만들었다. 말했던대로 <a href=\"http://dna.daum.net/services/apis/blog\">다음블로그 API</a>를 사용했고 티스토리 에디터와 비슷한 스타일로 만들었다. 완전히 처음부터 시작해야 설명이 쉬울 것 같아 Hello, world부터 시작해서 리스트, 에디터를 붙여나갔다. 그래서 어찌어찌 만들기는 했는데 저장 요청이 실패하는 치명적인 문제를 남겨두고야 말았다. 이래서야 발표할때 &#39;짠~&#39;하고 보여줄 수가 없다. 하지만 이건 분명히 api를 사용하는 부분이 미숙한 것이 원인이니 더이상 시간을 끌 수가 없다. 목표는 다음블로그 에디터를 만드는게 아니라 Electron을 설명하는 거니까 일단 넘어가기로 했다.</p>\n<p>다음블로그 에디터 : <a href=\"https://github.com/joostory/daumblog-editor\">https://github.com/joostory/daumblog-editor</a></p>\n<h2 id=\"-\">발표자료 준비</h2>\n<p>그 다음은 발표자료를 만들었다. 요새 우분투가 설치된 넷북만 사용하는 중이라 발표자료도 Libre Office의 Impress로 만들었다. 발표를 자주하는게 아니라서 이런 프로그램을 거의 사용안하는데 막상 하려니 너무 안이뻤다. 키노트가 얼마나 위대한 프로그램인지 새삼느껴졌다.</p>\n<iframe src=\"https://www.slideshare.net/slideshow/embed_code/key/n9ICAtOpx0EEE7\" width=\"595\" height=\"485\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" style=\"border:1px solid #CCC; border-width:1px; margin-bottom:5px; max-width: 100%;\" allowfullscreen=\"allowfullscreen\"></iframe>\n\n<h2 id=\"-\">발표</h2>\n<p>발표 전에 예행연습이랍시고 몇번이나 소리내면서까지 읽었는데도 결국 발표에서는 어리버리했다. 역시 더 철저하게 준비했어야 했다. 따로 준비하지 않아도 자연스럽게 되는 일은 나에겐 일어나지 않는 것 같다. 난 순발력이 떨어져서 그게 잘 안되는 것 같다. 소스코드가 눈에 잘 보이지도 않고 시연할때 비밀번호를 잊어버리고 ㅠㅠ</p>\n<p>어쨌든 모든 것은 다 끝났다. 아쉬움이 많이 남지만 이제 글로 쓸때라고 생각한다. 발표했던 것을 좀 더 자세히 글로 적어볼 생각이다. 아마도 3-4번의 글을 쓰게 될 것 같다.</p>\n            ","summary":"재미로 시작한 Electron인데 어쩌다보니 세미나까지 하게 되었다. 파트 개발자 모임을 활성화하려고 하는데 시작할 계기를 만들어야 했고 때마침 내가 왜 그랬는지 모르겠지만 Electron으로 세미나를 하겠다고 했다. 다음블로그 api를 사용해서 지금 글을 쓰고 있는 티스토리 에디터 같은 것을 만드는 과정을 설명하면 되겠다고 이야기를 꺼냈다가 하는 것으로 결정되어 버렸다. 사실 나도 지금까지 알게된 것들을 정리해보고 싶었기도 했기에 이참에 정리를 해보는","image":"https://t1.daumcdn.net/tistory_admin/static/images/openGraph/opengraph.png"}},"__N_SSG":true}