{"pageProps":{"post":{"id":"468","date":"2017. 3. 16. 17:19","title":"싱글라이더","content":"<p>&#39;이병헌이 나온다&#39;는 정보만 가지고 있던 영화다. 왓챠 &#39;보고싶어요&#39;에 넣어두지도 않은 영화다. 지금은 영상물이 넘쳐나고 시간은 제한되어 있어서 무려 2시간 가량을 완전히 가져가는 영화는 재미있겠다는 기대가 없으면 보지 않는다. 하지만 왠지 이 영화는 이병헌의 영화라는 점에서 끌린 것 같다.</p>\n<p>영화는 한국에 혼자 남은 기러기 아버지의 암울한 삶으로 시작한다. 아이를 그리워하며 아이의 영상을 보고 위태위태한 회사상황에 괴로워하고 퇴근 후에는 혼자 소파에 누워 쉰다. 위기에 빠진 회사상황에 지친 남자는 아이가 보내준 생일축하카드를 보면서 홀로 스시를 먹다가 문득 아이가 있는 호주행 비행기 티켓을 예매한다.</p>\n<p>여기까지만 보니 왠지 이후의 내용이 머리 속에 그려지는 것 같았다.</p>\n<blockquote>\n<p>호주에 갔더니 아내는 다른 남자와 바람이 났다. 지루한 감정싸움을 하다가 결국 남자는 아내에게 버려지고 갈 곳을 잃어버린다. 돌아온 한국에서 회사까지도 남자를 버린다. 절망한 남자는 괴로워하며 영화는 끝난다.</p>\n</blockquote>\n<p>만약 정말 영화가 이런 내용이라면 너무 우울한 기분이 들 것만 같았다. 물론 잘 만든 우울한 영화도 큰 감동을 주긴 하지만 정말 잘 만들었을 때 그렇다는거다. 실제로 이 후의 내용도 예상한 것과 비슷하게 흘러가긴한다. 힘겹게 집으로 찾아가자 어떤 남자와 대마초를 피고 있는 아내를 발견한다. 아내의 바람을 발견한 남자는 좌절하며 주변을 멤돈다.</p>\n<h2 id=\"-\">사람들</h2>\n<p>남자는 주변을 멤돌며 여러 사람들을 만난다. 이상하게 남자를 따르는 아내의 개, 같은 한국인에게 사기당한 여자, 그 동네에 40년간 살아온 할머니, 이웃집 남자의 부인, 다리 위의 남자를 만난다. 만난다는 것은 서로 대화를 하는 것을 말한다. 핵심인물이라 할 수 있는 아내와 아들, 이웃집 남자, 이웃집 아이는 관찰만 한다. (아들과 잠시 대화 비슷한 것을 나누는 것은 아들이 몹시 아팠을때 잠시뿐이다.) 남자는 이들에게 개입하지 않고 이들도 남자에게 개입하지 않는다.</p>\n<p>남자가 만난 사람들은 나중에 다 밝혀지지만 모두 죽은 사람들이다. 직접적으로 죽었음을 보여준 사람은 사기당한 여자, 아내의 개 뿐이지만 남자도 죽었음이 드러나면서 남자와 대화한 사람도 모두 죽었거나 죽음에 가까운 상태임도 함께 드러난다.</p>\n<h2 id=\"-\">수많은 복선</h2>\n<p>이 영화는 두가지 측면이 있다. 남자의 죽음을 알기 전과 알고난 후 영화에 등장하는 요소요소의 의미가 전혀 다르게 보이는 것이다. 감독은 남자의 죽음을 암시하는 복선들을 쭉 나열해놓고 마지막 순간에 터뜨리며 잔잔한 영화에 커다란 물결을 만들고자 했다. 그리고 나에겐 그 작전이 성공했다.</p>\n<p>사기당한 여자가 죽었음이 드러난 순간에도 난 정신차리지 못하고 멍하니 있었다. 잠시 후에야 이들이 자신들의 죽음에 대해서 말하고 있다는 것을 알아차렸다. 그러자 갑자기 영화의 내용이 머리속에 다시 한번 되살아났다. 가져오지 않은 휴대폰, 대중교통, 늘 깨끗한 셔츠, 바뀌지 않는 옷, 차에 치인 개, 죽어가는 이웃집 남자의 아내, 호통치는 할머니 이 모든 것이 남자의 죽음을 알려주는 요소였던 것이다.</p>\n<p>내가 큰 감동을 받은 이유는 바로 이 반전 때문이었다. 작은 사건들이 한꺼번에 저마다의 새로운 사건으로 살아나 움직이는 것은 꽤나 감동이었다.</p>\n<p><img src=\"https://t1.daumcdn.net/cfile/tistory/2115CF4458CC971921\" alt=\"\"></p>\n<hr>\n<p>물론 처음에 예상했던 이야기에서 크게 벗어나지 않았다는 것이 조금 아쉽고 남자가 자살을 한 것이라는 것이 조금 더 아쉽지만 그래도 한 남자의 죽음과 남은 가족의 이야기를 통해서 가족이 중요성을 생각하게 만드는 좋은 영화라고 생각한다.</p>\n            ","summary":"&#39;이병헌이 나온다&#39;는 정보만 가지고 있던 영화다. 왓챠 &#39;보고싶어요&#39;에 넣어두지도 않은 영화다. 지금은 영상물이 넘쳐나고 시간은 제한되어 있어서 무려 2시간 가량을 완전히 가져가는 영화는 재미있겠다는 기대가 없으면 보지 않는다. 하지만 왠지 이 영화는 이병헌의 영화라는 점에서 끌린 것 같다.\n영화는 한국에 혼자 남은 기러기 아버지의 암울한 삶으로 시작한다. 아이를 그리워하며 아이의 영상을 보고 위태위태한 회사상황에 괴로워하고","image":"https://img1.daumcdn.net/thumb/R800x0/?scode=mtistory2&fname=https%3A%2F%2Ft1.daumcdn.net%2Fcfile%2Ftistory%2F2115CF4458CC971921"}},"__N_SSG":true}