{"pageProps":{"post":{"id":"490","date":"2017. 5. 14. 22:49","title":"UFC 211 감상","content":"<p>남자들이 다들 좋아하는지는 모르겠는데 <a href=\"http://kr.ufc.com/\" target=\"_blank\" class=\"tx-link\">UFC</a>를 즐겨 보고 있다. 오늘 <a href=\"http://kr.ufc.com/event/ufc-211#/fight\" target=\"_blank\" class=\"tx-link\">UFC 211</a>에는 세기의 대결이라 불리는 미오치치와 산토스의 대결이 있었다. 그리고 프랭키 애드가, 야이르 로드리게스, 데미안 마이아, 마스비달, 에디 알바레즈, 포이리에 등등 기대되는 경기가 엄청 많았다.</p><h2>에디 알바레즈 vs 더스틴 포이리에</h2><p>알바레즈는 그닥 좋아하는 선수가 아니어서 포이리에가 이겼으면 하는 마음으로 보고 있었는데 포이리에가 승기를 잡았다가 순간 펀치 허용하면서 역전 당하나 했는데&nbsp;반칙으로 경기가 무효가 되었다. 좀 아쉬웠지만 다음에 다시 싸우면 포이리에가 이걸 것도 같다. 알바레즈는 챔피언에서 내려온 후부터 징검다리 선수가 된 것 같은 느낌.</p><h2>SPOTV의 황당 중계</h2><p>SPOTV가 UFC를 중계해줘서 너무 감사한 마음이 있다. 그래서 리그오브레전드 같은 경우도 SPOTV games를 통해서 보려고&nbsp;노력하는 중이다. 근데! 지난번에도 그러더니 이번에도 중계를 갑자기 중단해버렸다. 지난번에는 이후에 야구중계가 있어서 우선순위에서 밀린거려니 하고 넘어갔는데 이번에는 도저히 이해가 안된다.</p><p>알바레즈와 포이리에 경기를 보기까지 무려 2시간동안 별로 관심없는 경기를 봤다. 그리고 이제서야 관심있는 경기를 보겠구나 싶었는데 11시가 되었다고 중계를 끝내버렸다. SPOTV ON 인가 하는 채널에서 계속 볼 수 있다고 했다. 난 그게 무슨 인터넷 중계인 줄 알았더니 그게 아니고 BTV에서만 제공하는 채널이다. 그러니까 그냥 중계가 끝난거다. -_- 겁나 날씨도 좋고 시원한 날 아침 산책도 포기하고 집에서 기다렸는데... 너무 배신감이 느껴진다.</p><p>그리고 중계를 끝내고 이어서 방송된 것은 무려 UFC 해비급 경기만 편집해서 보여주는 특집 프로그램이었다. 똑같은 UFC에 대한 내용이지만 지금 진행되는 경기는 Btv에만 있는 채널에서밖에 보여줄 수 없는거냐? 생각하면 생각할 수록 화가 난다. 이 늦는 밤이 되어서야 외국 방송사 영상으로 겨우 봤다. 항의메일을 보내봐야겠다.</p><h2>프랭키 애드가 vs 야이르 로드리게즈</h2><p>로드리게즈가 날렵해서 어찌 되지 않을까 생각했는데 프랭키 애드가는 역시 대단했다. 빠른 몸 놀림으로 로드리게즈를 바닥에 눕혀버리더니&nbsp;그걸로 경기가 끝났다. 물론 경기는 2라운드까지 10분 경기를 했지만 누운 뒤로 로드리게즈는 일어나지 못했다. 심지어 움직이지도 않고 한자리에서... 애드가는 지금 챔피언들한테 좀 허무하게 지는 경우가 있어서 그렇지 정말 대단한 사람이다.</p><h2>데미안 마이아 vs 호르헤 마스비달</h2><p>데미안 마이아는 김동현과 같이 매미권을 사용하는데 1라운드 내내 정말 매미처럼 매달려있었다. 누워서 매달린 것도 아니고 서서! 대단했다. 정말 징글징글하게 몸에 달라붙어서 균형을 무너뜨리려고 노력했다. 1라운드 마지막에 반격 좀 당한 것만 빼면 거의 마스비달에게 찰싹 달라붙어서 괴롭혔다. 이길만 했다. 단지 라이브로 이 경기를 봤다면 좀 지루했을 듯 싶다. 막 넘기면서 봤다.</p><h2>스티페 미오치치 vs 주니어 도스 산토스</h2><p>오~ 이 경기를 보기 위해서 얼마나 기다렸던가! 생각보다 경기 영상 길이가 짧아서 이건 1라운드 KO다 생각했다. 역시나&nbsp;1라운드가 시작되자마자 누가 이겼을지 상상이 됐다. 미오치치가 슬금슬금 앞으로 갔고 산토스는 슬금슬금 물러서더니 케이지에 등이 닿았다. 산토스는 케이지 한가운데에서 활발하게 움직이면서 펀치를 주고 받는 스타일인데 저런 식으로 한쪽에 몰려서 못 움직이면 ;;;</p><p>결국 산토스는 허무하게 펀치에 맞아서 무너졌다. 미오치치가 정말 전략을 잘 짰다. 산토스가 젤 싫어하고 못하는 방식으로 싸웠다. 산토스는 이래가지고는 앞으로 미오치치랑 케인 벨라즈케즈한테 이기기는 글렀다.</p><hr><p>그러고 보니 에디 알바레즈랑 더스틴 포이리에 경기는 메인카드 경기도 아니네. 그래도 체급 3위랑 9위 선수 경기인데 너무하다 싶다. 그리고 SPOTV는 메인카드 경기 하나도 중계 안해준거네? -_- 아우!<br></p>            ","summary":"남자들이 다들 좋아하는지는 모르겠는데 UFC를 즐겨 보고 있다. 오늘 UFC 211에는 세기의 대결이라 불리는 미오치치와 산토스의 대결이 있었다. 그리고 프랭키 애드가, 야이르 로드리게스, 데미안 마이아, 마스비달, 에디 알바레즈, 포이리에 등등 기대되는 경기가 엄청 많았다.에디 알바레즈 vs 더스틴 포이리에알바레즈는 그닥 좋아하는 선수가 아니어서 포이리에가 이겼으면 하는 마음으로 보고 있었는데 포이리에가 승기를 잡았다가 순간 펀치 허용하면서 역전 당하","image":"https://t1.daumcdn.net/tistory_admin/static/images/openGraph/opengraph.png"}},"__N_SSG":true}