{"pageProps":{"post":{"id":"499","date":"2017. 6. 14. 01:26","title":"운동만 해서는 절대 살 못 뺀다?","content":"<iframe src=\"https://www.facebook.com/plugins/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fpermalink.php%3Fstory_fbid%3D1358205304227597%26id%3D100001144224107&width=500\" width=\"500\" height=\"501\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowTransparency=\"true\"></iframe>\n\n<p>이 기사는 다이어트에 대해서 잘못된 정보를 전달하고 있다. 운동은 다이어트에서 너무나도 중요하다. 나는 이것을 몇번이고 체험했다. 물론 식사를 조절하는 것이 체중 자체를 줄이는 데에는 더 효과적이긴 했지만 운동은 체중감소, 지방감소에도 효과가 있는데다 근육증가, 체력증가, 맑은 정신(?)등 사람을 건강하게 만드는게 큰 역할을 한다.</p>\n<h2 id=\"-\">군입대 전/후</h2>\n<p>군에 입대하기 전 나는 식사조절과 운동으로 나름 날씬한 몸을 유지하고 있었다. 기름진 것을 거의 먹지 않았고, 5시 이후엔 금식했다. 헬스장에서 한시간가량 운동을 해서 몸에는 힘이 넘쳤다.</p>\n<p>군인이 되고 나서는 식습관이 완전히 망가졌다. 초코파이를 흡입하고 튀김으로 배를 채우고 밤엔 뽀글이로 야식을 먹었다. 주머니엔 늘 간식이 있어서 생각날때마다 먹었다. 돼지가 됐냐고? 아니다. 입대 전과 똑같았다. 체중도 체형도.</p>\n<p>아침마다 10km구보, 때로는 산악구보를 했고 늘 청소도구로 청소를 했다. (자의는 아니다) 20kg짜리 박격포와 20kg짜리 군장을 어깨에 메고 훈련을 했고 늘 뛰어다녔다. 많이 먹었지만 늘 배고팠고 늘 졸렸다.</p>\n<p>전역을 하고나서 망가진 식습관은 그대로 이어졌지만 몸을 움직이는 일은 급격히 줄어들었다. 순식간에 5kg정도 체중이 늘었다. 다행히 1년여간 그 체중을 유지했지만 회사를 다니면서 체중은 점점 늘었고 15kg가량 증가했다. 뚱보가 됐다. 뚱보까지는 채 2년이 걸리지 않았다.</p>\n<h2 id=\"-\">무엇이 날 뚱보로 만들었나</h2>\n<p>군입대 말고도 몇번 체중이 왔다갔다한 경험이 있지만 이 이야기만 한 이유는 무려 15kg의 변화가 생긴 아주 극적인 사건이기 때문이다. 나도 주체할 수 없는 체중증가에 깜짝 놀랐다. 분명 군생활에서와 전역 후에서의 식습관은 비슷했다. 삼시세끼 다 먹고 간식먹고 야식을 먹었다. 다른 점은 몸을 얼마나 움직였느냐이다.</p>\n<p>이 체험과 이후의 체중감소를 위한 노력을 통해서 나는 어느 정도 사람의 몸이 운동과 음식에 의해서 변하는지 알 수 있었다. 분명 체중감소는 식사조절이 가장 효과적이다. 그러나 그것만 해서는 몸에 힘이 없다. 운동을 해야 몸에 힘이 생긴다. 그렇지만 운동을 하면 몸이 강렬하게 음식을 원한다. 이때가 중요하다. 허기를 달랠 수 있는 정도만 먹거나 참아야 한다. 그러면 건강을 유지하면서 체중도 줄어든다.</p>\n<hr>\n<p>저 기사를 쓴 사람은 소화가 잘 안되서 음식을 맘대로 못 먹는다고 한 것을 보니 평생을 저체중으로 살았을 것 같다. 그런 사람이 다이어트에 대해서 이러쿵 저러쿵 이야기하는게 너무 웃긴다. 해보긴 해봤나? 운동의 효과를 체험했고 지금도 체험하는 사람들이 뻔히 존재하는데 저게 무슨 소리람? 몇몇 연구자료와 자신의 추측을 섞어서 쓴 아주 요상한 글이라 생각한다.</p>\n<p>운동만 해서는 절대 살 못 뺀다고? 아니다! 조금 힘들 뿐이다.</p>\n            ","summary":"\n\n이 기사는 다이어트에 대해서 잘못된 정보를 전달하고 있다. 운동은 다이어트에서 너무나도 중요하다. 나는 이것을 몇번이고 체험했다. 물론 식사를 조절하는 것이 체중 자체를 줄이는 데에는 더 효과적이긴 했지만 운동은 체중감소, 지방감소에도 효과가 있는데다 근육증가, 체력증가, 맑은 정신(?)등 사람을 건강하게 만드는게 큰 역할을 한다.\n군입대 전/후\n군에 입대하기 전 나는 식사조절과 운동으로 나름 날씬한 몸을 유지하고 있었다. 기름진 것을 거의 먹지 않","image":"https://t1.daumcdn.net/tistory_admin/static/images/openGraph/opengraph.png"}},"__N_SSG":true}