{"pageProps":{"post":{"id":"526","date":"2018. 3. 5. 14:07","title":"고객센터에 문의하는 거 더럽게 불편하다","content":"<p>지난 주 금요일 신용카드를 재발급 받아서 카카오 페이에 등록해 둔 이전 신용카드 정보를 제거하려고 했다. 근데 황당하게도 멜론 정기결제에 연결되어 있어서 카드 정보를 삭제를 못한다는 거다. 깜짝 놀랐다. 그 카드는 법인카드였기 때문이다. 내가 실수로 정기결제를 법인카드로 했나 싶어서 급히 확인해보니 다행히 아니었다.</p>\n<p>문득 몇달 전 실수로 법인카드를 잘못 연결했다가 급히 변경한 기억이 난다. 설마 아니겠지. 그게 연결했다가 바로 변경했는데 그 정보가 남아있을리가 없지 생각하며 고객센터라는 곳에 문의를 넣어보기로 했다.&nbsp;조그마한 핸드폰에 두손가락으로 뭔가를 입력하는 것이 불편해서 컴퓨터로 할 수 있으면 좋겠다 생각했지만 아쉽게도 그런 안내는 없었다. (나중에야 알았다. <a href=\"https://pay-cs-web.kakao.com/\">PC로 접근할 수 있는 고객센터</a>가 있다는 것을)</p>\n<blockquote>\n<p>신용카드를 재발급받아서 이전에 등록한 카드를 삭제하려고 하는데 로엔 정기결제 중이라 삭제가 안된다는 메시지만 나와요.</p>\n<p>무슨 문제인지 알려주세요. 뭘 해야 삭제할 수 있죠?</p>\n</blockquote>\n<p>휴일에 문의를 한거니 당연히 며칠 걸릴 것이라 예상했다. 근데 기대하지도 않았는데 주말에 답이 왔다.</p>\n<blockquote>\n<p>멜론 가맹점을 통해 정기결제 해지하였으나, <br>카카오페이 서비스에 반영되지 않아 당황하셨을 텐데요. <br><br>번거로우시더라도, <br>빠른 처리를 위해 아래 정보 기재 후 재문의 부탁드립니다. <br><br>[<strong>정기결제 해지 신청 정보</strong>] <br>- 정기결제 해지를 원하는 카카오 계정: <br>- 카카오 계정에 연결된 휴대폰 번호: <br>- 카카오 계정 명의자 생년월일: <br><br>참고로 멜론 정기결제 서비스는 이용하시는 고객님께서 <br>해당 가맹점에 해지 요청 시 연결된 결제 서비스도 동시 처리됩니다. <br><br>다만, <strong>멜론 정책에 의해 서비스 연결 기록은 남아있어 </strong><br><strong>카카오페이 서비스 해지 시에는 별도 요청 시 가능한 점</strong> 양해 부탁드립니다.</p>\n</blockquote>\n<p>답은 빨리 왔는데 세가지 부분에서 좀 짜증이 났다. 먼저 멜론에 정기결제를 해지해도 카카오 페이 결제 정보가 남아있다는 점이다. 결제 정보를 어째서 남기는 건가? 그리고 그 남겨진 정보를 왜 결제하는 쪽에서 컨트롤 할 수 없는가? 내 정보가 니들거야?</p>\n<p>두번째 정기결제 해지신청을 하기 위한 정보를 달라는거다. 로그인된 폰에서 고객문의를 남겼는데 저 정보를 다시 달라니... 왜 이걸 자동으로 해줄 수가 없는거냐? 난 핸드폰으로 이걸 입력하고 있다고!</p>\n<p>마지막으로 가장 짜증나는 것이다. 저 정보를 걍 달라는 것도 아니고 다시 재 문의를 하라고 한다. -_- 아놔... 고객센터에서 모든 대답을 1회로 끝낼 수 있는게 아니면 몇번 주고 받을 수 있는 창구를 열어둬야 하는거 아니냐? 답장버튼만 누르고 내용 입력하면 이전 문의에 이어서 바로 답을 줄 수 있는 그런거 만들기 귀찮나? 고객센터 인력 싸게 부리니까 인력으로 커버하겠다는건가? 아니지, 고객센터 인력과 고객의 인력을 싸게 부리는거지.</p>\n<p>혹시 무슨 말인지 몰라서 다시 이전 문의에 대해서 물어볼까봐서 이전 문의 전부 복사해서 붙여넣고 이런 문의를 했었고 정보를 달라고 해서 다시 드립니다라고 문의를 했다. 다행스러운 것은 이때는 PC에서 했다는거다. 모바일로 이걸 해야했다면 포기했을거다. 걍 카카오 페이를 탈퇴하려고 했을지도 모르겠다. 솔직히 내 애사심에 이걸 쓰는거지 다른 이유는 하나도 없다.</p>\n<div>\n<blockquote>\n<div>고객님께서 기재해 주신 내용 중 카카오계정이 정확히 기재되어 있지 않아 재요청 드리오니 카카오 계정 (도메인 포함) 재기재 후 문의부탁드립니다.</div>\n<div>&nbsp;</div>\n<div>[정기결제 해지 신청 정보]</div>\n<div>- 정기결제 해지를 원하는 카카오 계정:</div>\n</blockquote>\n<div>아하하... 진짜 고민되는 답이 왔다. 이걸 또 하라니 ㅠ</div>\n</div>            ","summary":"지난 주 금요일 신용카드를 재발급 받아서 카카오 페이에 등록해 둔 이전 신용카드 정보를 제거하려고 했다. 근데 황당하게도 멜론 정기결제에 연결되어 있어서 카드 정보를 삭제를 못한다는 거다. 깜짝 놀랐다. 그 카드는 법인카드였기 때문이다. 내가 실수로 정기결제를 법인카드로 했나 싶어서 급히 확인해보니 다행히 아니었다.\n문득 몇달 전 실수로 법인카드를 잘못 연결했다가 급히 변경한 기억이 난다. 설마 아니겠지. 그게 연결했다가 바로 변경했는데 그 정보가 남아","image":"https://t1.daumcdn.net/tistory_admin/static/images/openGraph/opengraph.png"}},"__N_SSG":true}