{"pageProps":{"post":{"id":"538","date":"2018. 8. 15. 15:20","title":"브레이킹 배드 - 철저하게 이기적인 악마 월터이야기","content":"<p>&#39;<a href=\"https://www.amc.com/shows/breaking-bad\">브레이킹 배드</a>&#39;는 넷플릭스를 보기 전에도 재미있다는 평을 들었던 드라마다. 이미 <a href=\"https://www.netflix.com/title/80025172\">나르코스</a>를 보면서 마약상 이야기는 충분하다는 생각이 들었기 때문에 일부러 보지 않았다. 그러다가 또다시 주변분들에게 추천을 받아서 결국 보게 되었다.</p>\n<p><img src=\"https://t1.daumcdn.net/cfile/tistory/99A51D335B768F4D11\" alt=\"\"></p>\n<h2 id=\"-\">시작 - 찌질함</h2>\n<p>브레이킹 배드의 첫 이미지는 위의 이미지다. 수염기른 대머리 아저씨와 젊은 남자. 저 대머리 아저씨는 보는 이미지마다 무섭게 찌그린 표정으로 어딘가를 노려보고 있었다. 그래서 굉장한 악당의 이야기인가보다라고 생각했다. 그런데 왠걸 시즌1은 내 예상을 완전히 벗어났다. 마약이 나오기는 하는데 시한부 판정받은 힘없는 아저씨의 불쌍한 가족이야기였다.</p>\n<blockquote>\n<p>암에 걸려 시한부 판정을 받은 한 고등학교 화학 교사는 가족의 앞날을 위해 졸업한 제자에게 동업하여 마약을 만들어 팔 것을 제안한다.</p>\n<ul>\n<li>넷플릭스의 브레이킹 배드 요약</li>\n</ul>\n</blockquote>\n<p>시즌 1은 정말 말도 안되는 찌질함의 연속이었다. 고등학교 화학교사인 월터는 교사외에 세차장에서 알바를 한다. 월터의 아내 스카일러는 벼룩시장에서 물건을 사다가 되파는 일을 하고 있다. 하나뿐인 아들은 선천적으로 정신지체를 안고 있다. 그 와중에 월터는 암판정받고 집 전기세는 연체되고 있고 둘째를 임심했다.</p>\n<p>TV에서 마약상이 70만 달러 규모의 거래를 하는 것을 본 월터는 우연히 마약상 검거 현장에서 본 제시 핑크맨에게 접근해 마약 제조의 길로 들어선다. 내 생각엔 월터는 처음엔 그럴 맘이 없었는데 암판정을 받은 후에 굉장히 과감해진 것 같다. 암치료를 위해 돈이 필요했고 돈을 위해서 뭐라도 해보자는 생각이었던 것 같다.</p>\n<h2 id=\"-\">변화 - 욕망과 자존심의 화신</h2>\n<p>처음엔 약파는 것도 실패하고 사람도 죽일때 벌벌 떨기고 하고 마약상에게 당하기도 했는데 점점 암치료에 들어가는 비용 이상의 것을 욕심내기 시작한다. 내 생각엔 다른 마약상에게 소속된 화학자처럼 마약제조 전문가로 있어도 충분히 보호받으면서 많은 돈을 벌 수 있을 것 같은데 월터는 어떻게든 그들과 대등한 입장이 되길 원하고 어쩔때는 그들 위에 서려고 노력한다.</p>\n<p>그런 변화는 성격에도 영향을 준다. 처음 그는 고작 15달러를 마스터카드로 쓴 것 때문에 스카일러에게 혼날때도 아무런 반항도 못했다. 세차장에서 부당한 대우를 당할 때도 마찬가지였다. 그런데 어느샌가 조금만 자신의 자존심을 건드리면 불같이 화를 내고 즉각적인 복수를 했다. 자신을 방해하는 사람을 아무렇지도 않게 죽이게 되었고 자신과 뜻이 달라도 죽이기도 했다.</p>\n<p>그저 돈벌이로 시작했지만 어느덧 푸른 메탐페타민은 그의 성취가 되었으며 그 자체가 되었다. 이중생활을 하던 월터는 어느새 하이젠버그임을 숨기지 않고 자랑스럽게 드러낸다. 멕시코 카르텔의 앞잡이를 차마 못죽여서 벌벌 떨던 월터가 카르텔과의 전쟁에서도 승리한 거스를 죽임으로써 새로운 마약왕 하이젠버그가 된 것이다.</p>\n<h2 id=\"-\">가족 - 행복한 가족을 강요한 이기심</h2>\n<p>브레이킹 배드를 처음 보면서는 마약 이야기가 들어간 가족 드라마로 느껴질 정도였다. 힘겨운 암치료를 견디는 와중에도 가족에게 어려움을 전가하지 않으려는 월터의 모습은 너무 슬픈 모습이었다. 가족을 너무 사랑하는구나, 가족을 지키고 싶구나 싶었다.</p>\n<p>끊임없이 월터를 의심하고 몰아세우는 스카일러가 악녀로 보였다. 도대체 왜 스카일러는 월터는 믿고 기다려주지 못하나 너무너무 답답하게 느껴졌다. 스카일러가 너무 이기적이라는 생각이 들었다. 그런데 중반을 넘어서면서는 월터가 오히려 자존심만 내세우는 이기적인 인간으로 변해버렸다.</p>\n<p>월터를 응원하는 나도 점점 월터의 일이 잘 풀리면 좌절감이 느껴지고 화가 났다. 월터에게 끌려다니게 된 스카일러가 불쌍하게 느껴졌다. 분명 월터를 믿어줬으면 했는데 이젠 왜 월터를 믿고 따르는지 이해가 안됐다. 월터가 입만 열면 하는 &#39;우리 가족을 위해서&#39;라는 말이 역겹게 느껴졌다. 입만 열면 거짓말하고 의심하면 자신을 믿고 따르지 않는 것에 대해서 화를 내는 월터를 보면서 월터가 말하는 &#39;행복한 가족&#39;이란 게 무엇인가 싶었다.</p>\n<p>이 부분에서 나를 돌아보게 됐다. 나는 과연 행복한 가족을 말할 수 있는 사람인가? 난 월터만큼이나 이기적인 사람이다. 나는 가족을 위해서 아무것도 안하지만 가족은 행복했으면 하는 마음. 내가 이정도 했으니까 이젠 알아서 되겠지라는 마음. 설득하지도 않고 명령하듯 내 뜻대로 움직여줬으면 하는 마음. 내가 월터를 욕할 자격이 있나?</p>\n<h2 id=\"-\">마치며</h2>\n<p><img src=\"https://t1.daumcdn.net/cfile/tistory/99A8F7345B76441D3A\" alt=\"\"></p>\n<p>결국 브레이킹 배드의 이런 첫 이미지들은 내용의 핵심 내용을 잘 표현하고 있었다. 극악무도한 마약왕 하이젠버그, 그의 철저하게 이기적인 이야기였다. 보는 내내 불편했지만 내 마음의 악을 나는 잘 다스리고 있는지, 나의 가족에게 나는 어떤 사람인지 돌아보게 되는 좋은 작품이었다.</p>\n            ","summary":"&#39;브레이킹 배드&#39;는 넷플릭스를 보기 전에도 재미있다는 평을 들었던 드라마다. 이미 나르코스를 보면서 마약상 이야기는 충분하다는 생각이 들었기 때문에 일부러 보지 않았다. 그러다가 또다시 주변분들에게 추천을 받아서 결국 보게 되었다.\n\n시작 - 찌질함\n브레이킹 배드의 첫 이미지는 위의 이미지다. 수염기른 대머리 아저씨와 젊은 남자. 저 대머리 아저씨는 보는 이미지마다 무섭게 찌그린 표정으로 어딘가를 노려보고 있었다. 그래서 굉장한 악당의 이","image":"https://img1.daumcdn.net/thumb/R800x0/?scode=mtistory2&fname=https%3A%2F%2Ft1.daumcdn.net%2Fcfile%2Ftistory%2F99A8F7345B76441D3A"}},"__N_SSG":true}