{"pageProps":{"post":{"id":"543","date":"2018. 12. 23. 15:37","title":"쿠팡 로켓와우. 생각보다 싸고 편하다","content":"<p>쿠팡에서 로켓배송을 아주 자주 사용하는 편이다. 원래 인터넷 쇼핑을 잘 안하는 편인데 아이가 태어나고 이거저거 하나씩 사다보니 어느새 기저귀, 물티슈 이런걸 정기배송을 받고 있고 필요한 걸 하나하나 사다보니 어느새 쿠팡에서만 사고 있다.</p>\n<p>이렇게 된 이유는 무엇보다도 로켓배송에 대한 믿음 때문이다. 보통의 인터넷 구매는 주문 후에 판매자가 언제 주문을 확인했는지, 언제 배송을 접수했는지, 택배발송이 시작되었는지 알 수 없다. 그래서 매번 들어가서 확인을 한다. 반면에 로켓배송은 배송시간을 정확히 예측가능하다. 내가 오늘 주문했으면 내일 온다. 로켓배송기사가 바뀌지만 않는다면 내가 사는 지역에 일정한 시간에 도착한다.</p>\n<p>단점이 하나 있는데 2만원 이상 구매를 해야한다는 것이다. 그래서 꼭 필요한 것을 사면서 이따금 당장은 불필요한 것을 사기도 했다. 물론 그게 쿠팡이 원한 것이겠지. 하지만 결국 이런 불필요한 것을 산다는 것은 배송비를 내는 것과 비슷하다. 그래서 고심고심하다 <a href=\"https://loyalty.coupang.com/loyalty/sign-up/home?source=HOME&amp;from=home_C1&amp;traid=home_C1\">로켓와우</a>라는 것을 시작했다.</p>\n<p style=\"text-align: center;\"><img src=\"https://t1.daumcdn.net/cfile/tistory/99C7BE385C1F85450F\" alt=\"\"></p>\n<p>로켓와우의 가장 큰 특징은 구매금액에 상관없이 로켓배송이 된다는 것과 로켓와우 전용상품의 구매이다. 당일배송, 30일 무료반품도 있는데 아침에 구매를 하는 일도 없고 물건을 고심고심해서 구매하는 편이라 반품할 일도 없어서 이 두가지는 나에게 아무런 이득이 없다.</p>\n<p>오늘까지 며칠 사용해보지는 않았지만 몇번의 사용경험으로 보자면 너무너무 편하다. 미안할 정도로 편하다. 몇천원짜리 하나 구매해도 배송이 되니까 나때문에 배송기사님 고생하는거 아닌가 생각이 들 정도다. 이젠 금액을 맞출 필요가 없어져서 아무 생각없이 필요한 거 담아서 구매버튼을 누른다.</p>\n<p>그리고 또 좋았던 점은 신선식품의 배송이었다. 식빵, 브로콜리, 파 같이 마트에 가서 이따금씩 사오는 것들. 마트, 집 앞 채소가게에서도 배송을 해본 적이 없는데 이걸 내가 쿠팡에서 사고 있다. 다음날 아침에 먹을 것을 살 수 있는 것이 이렇게 좋을 줄이야.</p>\n<p style=\"text-align: center;\"><img src=\"https://t1.daumcdn.net/cfile/tistory/998BB33E5C1F898313\" alt=\"\"></p>\n<p>장점만 있느냐 그렇지는 않다. 이전에도 이야기했지만 배송기사에 대한 미안함. ;;; 나는 이제 진짜 2천원짜리 3천원짜리 이러거 막 사고 싶은데 이런거 때문에 새벽에 일어나서 여기까지 와서 문앞에 두고 가야하다니...</p>\n<p>두번째는 포장재의 낭비다. 2천원짜리 신선식품 포장에 녹색 비닐 포장지와 아이스팩이 하나씩 들어간다. 5천원짜리 냉동식품 하나에 커다란 스티로폼 박스와 드라이아이스 4개가 들어간다. 마트에서 비닐도 공짜로 안주는 세상에 이런 포장이라니...</p>\n<p>배송기사에 대한 미안함은 어쩔 수 없다고 치더라도 포장재 문제는 조금 개선을 했으면 좋겠다. 어차피 로켓와우라는 것이 유료멤버쉽이니까 이 사용자들은 거의 대부분의 물건을 쿠팡을 통해서 살 것이라고 예상할 것이다. 그러니까 하겠지. 그렇다면 새벽배송 물품을 담을 보온주머니를 하나씩 준비하도록 하는게 어떨까? 신선식품을 드라이아이스 하나랑 같이 넣어주는거다. 지금 하는 것보다는 냉장효과가 덜 할 수는 있겠지만 빨리 꺼낸다면 괜찮지 않을까? 예전에 우유주머니에 우유배달 받아먹을때도 비슷하게 했던 것 같다.</p>\n<hr>\n<p>어쨌든 이런 좋은 서비스 앞으로도 계속 이용할 것 같은데 지속가능하도록 잘 운영되었으면 좋겠다. 쿠팡 화이팅.</p>            ","summary":"쿠팡에서 로켓배송을 아주 자주 사용하는 편이다. 원래 인터넷 쇼핑을 잘 안하는 편인데 아이가 태어나고 이거저거 하나씩 사다보니 어느새 기저귀, 물티슈 이런걸 정기배송을 받고 있고 필요한 걸 하나하나 사다보니 어느새 쿠팡에서만 사고 있다.\n이렇게 된 이유는 무엇보다도 로켓배송에 대한 믿음 때문이다. 보통의 인터넷 구매는 주문 후에 판매자가 언제 주문을 확인했는지, 언제 배송을 접수했는지, 택배발송이 시작되었는지 알 수 없다. 그래서 매번 들어가서 확인을 ","image":"https://img1.daumcdn.net/thumb/R800x0/?scode=mtistory2&fname=https%3A%2F%2Ft1.daumcdn.net%2Fcfile%2Ftistory%2F99C7BE385C1F85450F"}},"__N_SSG":true}