{"pageProps":{"post":{"id":"544","date":"2018. 12. 25. 23:31","title":"카카오 미니, 구글 홈 결국 둘다 사용하게 된 이유","content":"<p>아마존 에코로 시작된 인공지능 스피커 싸움이 한창이다. 처음엔 비싼 가격때문에 별로 사용을 못하고 있다가 이제는 집집하나 하나씩은 다 있는 분위기다. 나같은 막귀에게는 저렴한 음악 플레이어로도 꽤 괜찮다. 물론 음악 스트리밍을 사용하지 않거나 예민한 귀를 가지고 본격적인 음악감상이 필요한 사람에게는 이건 완전 비추다.</p>\n<h2>카카오 미니</h2>\n<p>이 인공지능 스피커 중 하나인 카카오 미니를 집에 들인 후로 소소한 재미가 생겼다. 아이가 있는 집에선 다들 그럴텐데 아직 말도 제대로 못하는 아이가 카카오 미니랑 이야기를 나누는게 너무 재미있다. 그리고 음악 찾아듣는 용도로는 꽤 괜찮은 편이다. 요즘엔 요리할 때 타이머 용도로 사용한다. 일정은 구글 캘린더 연동이 없다면 거의 무용지물.</p>\n<p>국내 회사에서 인공지능 스피커가 이미 4개 정도 나왔는데 카카오 미니를 사기로 결정한 이유는 무엇보다도 저렴한 가격, 멜론과의 연동 때문이다. 우선 통신사 스피커들은 사고 싶지 않다. 거기서는 자꾸 IOT, IOT 하는데 크게 와닿지도 않고 별로 좋다고 생각하지도 않는다. 불키고 끄는거 외에는 다 직접 손으로 하는게 좋다. 네이버의 스피커는 조금 비싸기도 했고 사용할 맘이 없는 네이버 뮤직을 사용해야해서 포기했다.</p>\n<p>장점은 그닥 없다. 그저 멜론과의 연동.... 음... 그것뿐인 것 같다. 저렴한 가격? 가족이 모두 사용하는 거라서 카카오톡으로 메시지를 보낸다거나 확인한다거나 하는건 거의 할 수 없고 음식 배달도 내 생각에는 직접 메뉴판 보고 고르는게 더 좋은 것 같다. 장을 보는 것도 마찬가지. (더구나 난 쿠팡와우를 사용 ;;; 사실 배달도 배달의 민족 ;;;) 그러고보니 사람 목소리별로 카카오 계정 연동해서 메시지 보내거나 확인할 수 있으면 좋을 것 같다. 그럼 좀 사용할 것 같다.</p>\n<p>아쉬운 점은 많다. 경쟁사가 많기 때문에 아무래도 경쟁사 서비스가 배제된다. 아마존도 구글이랑 유투브가지고 싸웠으니 뭐 이건 어디나 똑같을 듯. 압도적인 1등이라면 어떻게 해보겠지만 그게 아니니 어쩔 수가 없다. 가장 아쉬운 것은 크롬캐스트 컨트롤이다. 충분히 가능할 것 같은데... 아닌가? 가능하지 않은가? 그 자세한 것은 알아보지 않아서 알 수 없지만 나는 이 스피커에게 크롬캐스트로 유투브나 넷플릭스 영상을 보내달라고 하고 싶다. 그게 된다면 활용도가 크게 올라갈텐데 하는 생각이 든다.</p>\n<h2>구글 홈 미니</h2>\n<p>카카오 미니에서 아쉬웠던 크롬캐스트 연동이 가능한 것도 있다. 바로 구글 홈이다. 당연히 구글 기계들이니 되겠지. 게다가 구글 홈 미니가 카카오 미니보다 더 싼 가격에 나와서 맘이 흔들리고 있었다. 이때 이 이벤트 소식을 들었다. 카드만 만들어서 사용하면 구글 홈 미니를 준단다.</p>\n<p style=\"text-align: center;\"><img src=\"https://t1.daumcdn.net/cfile/tistory/9912934E5C2237AC05\" ></p>\n<p>이건 망설일 이유가 없다. 돈이야 늘 쓰고 있으니 카드 연회비 만원만 내면 되는거다. 바로 이벤트에 응모했고 이것이 집에 왔다.</p>\n<p>첫인상은 너무 좋았다. 성우를 썼는지 만들어진 소리인지는 모르겠지만 중저음이 풍부한 남자의 목소리가 너무 맘에 들었다. 카카오 미니의 여자 목소리도 아주아주 좋았지만 구글 홈의 목소리가 더 좋았다. 그래서 그런지 스피커 성능도 더 좋아(?)보였다.</p>\n<h2>카카오 미니 vs 구글 홈 미니</h2>\n<p>어쩔 수 없이 이 둘은 비교할 수 밖에 없었다. 둘 다 한자리에 두기엔 뭔가 좀 이상하다 생각했기 때문에 (아무도 관심없는) 자리 정하기 싸움이 시작된 것이다.</p>\n<p style=\"text-align: center;\"><img src=\"https://t1.daumcdn.net/cfile/tistory/9982EE455C2230F20A\" ></p>\n<p>구글 홈 미니의 스피커 성능은 기대하지 말랬지만 막귀인 나에겐 좋게 들렸다. ;;; 그리고 비교대상이 카카오 미니뿐이니 뭐 상관없었다. 앞서 말했지만 좋은 목소리의 첫인상 때문에 성능이 더 좋아보였다. 하지만 정확한(?) 비교를 위해서 같은 음악을 재생해보았다. 예상했던대로 내 막귀가 정확히 장단점 비교를 할 수 있을리가 없었다. 스피커 성능은 <strong>비김</strong>.</p>\n<p>유투브 음악. 이 서비스는 정말 정말 좋지 않다고 생각한다. 음악이 없는 경우는 거의 없긴 했지만 내가 원하는 건 정식 앨범인데 아닌걸 많이 들려준다. 심지어 어떤 사람이 커버하면서 혼자 주절거리는 게 나오기도 했다. -_- 확실히 유투브에서 들었던 것이 아닌건 듣지 않기로 했다. 게다가 카카오 미니에서는 동화 읽어달라고 하면 아이이름을 겁나 따스하게 불러주면서 대화하듯이 동화를 들려준다. 컨텐츠 편의성면에서는 <strong>카카오 미니 압승</strong>!</p>\n<p>크롬캐스트. 처음엔 조금 컨트롤하기 어려웠지만 'TV에 OOO 보여줘' -&gt; '유투브에서 OOO 검색해서 보여줘', '넷플릭스로 OOO 보여줘' -&gt; '넷플릭스로 OOO 보여줘' (이건 차이가 없네) 요렇게 변환된다 생가해고 말하니 적응했다. 이건 뭐 카카오 미니에 기능 자체가 없으니 <strong>구글 홈 미니 승</strong>!</p>\n<p>음성인식은 이건 좀 호불호가 갈릴 것 같기도 하고 익숙한 것때문인지도 모르겠지만 카카오 미니쪽이 더 편하긴하다. '카카오야' - '띵 (듣고 있다는 효과음)' - 'OOO 해줘' 이런 식으로 카카오 미니에게는 말했는데 구글 홈에서는 'ok 구글 OOO 해줘' 바로 이렇게 말을 해야한다. 듣고 있다는 효과음은 없지만 실제로는 비슷하게 동작하고 있어서 사실 'ok 구글' - '(1초 정도 후에) OOO 해줘' 라고 말을 해야한다. 그리고&nbsp; 들었다면 확실하게 피드백을 해주지만 'ok 구글'을 못 들은건지, 'OOO 해줘'를 못들은건지 잘 구분을 못하겠다. 그래서 눈으로 듣고 있다는 것을 자꾸 확인하게 된다. 위쪽에 동작여부가 표시된다. 물론 익숙해지면 어떻게 될지 모르겠지만 현재로서는 듣고 있다는 효과음이 있는 <strong>카카오 미니 승</strong>!</p>\n<p>카카오 미니에서는 구글 일정을 읽을 수 없어서 일정 같은 것을 확인할 수 없다. 그래서 개인적인 활용도면에서는 구글의 압승일 거라고 생각했는데 이게 왠걸... 난 구글 앱스를 사용하고 있어서 일반 구글 계정으로 연동한 구글 홈에서 일정이나 주소록 같은 걸 사용할 수가 없다. 스스로 손발을 묶은 느낌. 하지만 '좋은 아침', '나 나간다', '나 왔어' 등의 루틴기능이 있어서 이걸 잘 활용한다면 아주 좋을 것 같다. 그래서 활용도 면에서는 <strong>구글 홈 미니 승</strong>!</p>\n<hr>\n<p>총점은 2승 1무 2패로 동률이다. 그래서 결국 거실에 둘다 두기로 했다. 하나는 음악듣고 동화듣는 용도, 하나는 동영상 플레이어(;;;). 어쨌거나 6개월간 유투브 프리미엄을 사용할 수 있으니 광고없이 유투브를 볼 수 있겠다. 음악과 오리지널은 좀 보니까... 망할 듯. ;;;</p>            ","summary":"아마존 에코로 시작된 인공지능 스피커 싸움이 한창이다. 처음엔 비싼 가격때문에 별로 사용을 못하고 있다가 이제는 집집하나 하나씩은 다 있는 분위기다. 나같은 막귀에게는 저렴한 음악 플레이어로도 꽤 괜찮다. 물론 음악 스트리밍을 사용하지 않거나 예민한 귀를 가지고 본격적인 음악감상이 필요한 사람에게는 이건 완전 비추다.\n카카오 미니\n이 인공지능 스피커 중 하나인 카카오 미니를 집에 들인 후로 소소한 재미가 생겼다. 아이가 있는 집에선 다들 그럴텐데 아직 ","image":"https://img1.daumcdn.net/thumb/R800x0/?scode=mtistory2&fname=https%3A%2F%2Ft1.daumcdn.net%2Fcfile%2Ftistory%2F9982EE455C2230F20A"}},"__N_SSG":true}