{"pageProps":{"post":{"id":"553","date":"2019. 3. 2. 00:40","title":"2019년 2월 넷플릭스 추천작","content":"<p>뭔가 <a href=\"https://blog.joostory.net/551\">1월에 추천작이라는 글</a>을 쓰고 나니 2월에도 써야할 것 같아서 정리를 해보려고 한다.</p>\n<h2>추천1. 언브레이커블 키미슈미트</h2>\n<p><a href=\"https://www.netflix.com/title/80025384\">언브레이커블 키미슈미트</a>는 2015년에 처음 시작된 시리즈인데 최근에 시즌4가 업데이트되어서 그런지 계속해서 내 추천리스트에 보였다. 그닥 관심이 없어서 안보다가 뭔가 싶어서 그냥 한번 봤는데 정주행하게 되었다.</p>\n<p><iframe src=\"https://www.youtube.com/embed/LIdFa1qLgNQ\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"\" data-opengraph-url=\"https://www.youtube.com/watch?v=LIdFa1qLgNQ\" data-opengraph-image=\"https://i.ytimg.com/vi/LIdFa1qLgNQ/maxresdefault.jpg\" data-opengraph-title=\"Unbreakable%20Kimmy%20Schmidt%20%7C%20Opening%20Theme%20by%20Jeff%20Richmond%20%5BHD%5D%20%7C%20Netflix\"></iframe></p>\n<p>정주행을 한 이유는 이 오프닝 때문이라고 해도 과언이 아니다. 이 부분이 너무 재미있다. '인터뷰 말투가 랩같네' 라고 생각하고 있었는데 이게 오프닝일 줄이야. 아직 시즌4까지를 모두 보지는 못했지만 그래도 이따금 실실 웃고 싶을때 보면 좋을 재미있는 작품이다.</p>\n<h2>추천2. 블라인드 사이드</h2>\n<p><a href=\"https://www.netflix.com/title/70119811\">블라인드 사이드</a>는 무려 2009년작이고 오래전에 봤던 작품인데 별 5개를 줄만큼 감동받은 작품이라 다시 봤다. 산드라블록의 시크하면서도 따뜻한 말투가 너무나 인상적인 따뜻하고 따뜻하며 끝까지 따뜻한 작품이다. 중간에 갈등도 넣을 법한데 실화라서 그런지 없는 갈등을 넣을 수는 없었던 것 같다. 지금 다시 보니 약간 엉성한 느낌도 받게 되긴하는데 그래도 뭐 지금도 나름 볼만하다고 생각한다.</p>\n<h2>추천3. 한니발</h2>\n<p><a href=\"https://www.netflix.com/title/70299750\">한니발</a>은 영화 양들의 침묵 이전의 이야기, 레드 드래곤의 드라마 버전이다. 앤소니 홉킨스의 한니발이 정말 어마어마 했는데 매즈 미켈슨이라면 그 어마어마한 인물을 표현하는데 충분할 것 같다. 역시 예전에 나온 작품을 이제 본 것인데 (사실 아직 시즌1도 다 못봤다.) 에피소드 하나하나가 영화같다. 약간 덱스터같은 느낌을 좀 받긴 했지만 매즈 미켈슨이 너무 멋있어서 생각이 멈춰버렸다. 그냥 감탄하며 보게 된다.</p>\n<h2>추천4. 원펀맨</h2>\n<p><a href=\"https://www.netflix.com/title/80117291\">원펀맨</a>은 뭐 몇번째 보는지 모르겠다. 넥플릭스에 최근 들어왔으니 한번 또 봐줘야지. 4월에 시즌2 애니가 나온다는데 그것도 넷플릭스로 볼 수 있으면 좋겠다. 만화는 여기저기서 주워보고 있는데 정식으로 볼 수 있는 곳이 있다면 구독해서 보고 싶다.</p>\n<h2>추천5. 블랙팬서</h2>\n<p><a href=\"https://www.netflix.com/title/80201906\">블랙팬서</a>는 아카데미를 노리고 넷플릭스에서 오픈된 것 같다. 아무래도 수상이 유력하니 사람들이 많이 볼 것이라고 생각했을 것이다. 그렇다. 나도 이 작품 그닥 좋아하진 않지만 다시 보게 됐다. 그래도 다른 것보다는 나으니까. 블랙팬서는 아카데미에서 여러 상을 받았다. 몇몇은 이해가 되긴 하지만 작품상 후보에 오른 건 좀 의외다. '흑인 영화' 라는 것 말고 작품상 후보에 오를만한 이유가 뭔가? 그런게 좀 맘에 안든다. 영화자체로만 평가를 해야지... 이렇게 말하니까 엄청 나쁜 영화라고 생각하는 것 같은데 그렇진 않다. 몇몇 맘에 안드는 부분이 있지만 좋아하는 영화다.</p>\n<h2>추천6. 엄브렐러 아카데미</h2>\n<p><a href=\"https://www.netflix.com/title/80186863\">엄브렐러 아카데미</a>는 크게 실망할까봐 불안해서 보고 싶지 않았다. 근데 한번 보고나니 이건 최고다라는 생각이 들었다. 전체적인 스토리나 시나리오가 아주 좋고 영상도 너무너무 좋다. 원작이 소설이라던데 (만화였나 ;;) 락밴드 멤버가 쓴 작품이란다. 정말 대단한 사람같다. 시즌1이 마무리 되었는데 어서 시즌2 나왔으면 좋겠다.</p>\n<h2>추천7. 로마</h2>\n<p><a href=\"https://www.netflix.com/title/80240715\">로마</a>는 넷플릭스 영화 최초로 아카데미 3관왕을 차지한 작품이다. 물론 감독이 감독이니만큼 무시할 수 없었을 것이다. 1970년대 멕시코가 배경인데 왜 제목이 로마인지는 모르겠지만 기나긴 롱테이크와 차분한 시선 덕분에 더욱 영상에 집중할 수 있게 되는 것 같다.</p>\n<p><img src=\"https://t1.daumcdn.net/cfile/tistory/993738425C7A9DA326\" ></p>\n<p>클레오와 소피아의 비슷하면서도 다른 상황을 통해서 본질적으로는 같다고 할 수 있는 일을 여러가지 관점에서 볼 수 있도록 하는 것 같다. 포스터 이미지는 누가 고른지는 모르겠지만 이 영화의 핵심을 잘 말해주고 있는 것 같다. 가슴아픈 상황이지만 최대한 따뜻하게 마무리되는 그러면서 많은 생각을 하게하는 좋은 작품이었다.</p>\n<hr>\n<p>이제부터는 비추천이다. 정리하고 보니 몇개 없다. ;;;</p>\n<h2>비추천1. 벨벳 버즈소</h2>\n<p><a href=\"https://www.netflix.com/title/80199689\">벨벳 버즈소</a>는 시작하기 전부터 굉장히 광고를 많이 했었다. 그리고 무려 제이크 질렌할이 주연이라서 굉장히 기대가 됐다. 그리고 보다보니 작년에 우연히 재미있게 본 원더러스트의 주연들이 몇명 나와서 반가운 마음마저 들었다. 하지만 보면 볼수록 이 작품에 대한 실망감이 커지면서 광고와 배우들로 인해 높아졌던 기대는 완전히 사그라들었다. 넷플릭스 영화는 반드시 흥행을 해야한다는 마음이 없어서 그런지 감독이 자기맘대로 만드는 것 같다. 지금까지 본 넷플릭스 오리지널 영화 중에서 좋다고 느낀 작품이 거의 없었다. 이 작품은 완전 실망.&nbsp;</p>\n<h2>비추천2. 나이트 플라이어</h2>\n<p><a href=\"https://www.netflix.com/title/80202133\">나이트 플라이어</a>는 유명 소설원작이고 제작진이 엄청난 사람들이고 하면서 광고를 많이 봐서 보기로 선택한 작품이다. 하지만 나와는 좀 맞지 않는 것 같다. 보다가 중단했고 지금은 무슨 내용인지도 잘 기억이 안난다. 다시보면 기억이 날 것 같지만 다시 보고 싶지는 않다.</p>\n<h2>비추천3. Re: 제로부터 시작하는 이세계 생활</h2>\n<p><a href=\"https://www.netflix.com/title/80132022\">Re: 제로부터 시작하는 이세계 생활</a>은 일본 애니인데 누가 엄청 재미있다고 하는 말을 보고서 한번 볼까 하는 생각이 들어 보게되었다. 일본 작품 번역의 특징인 것 같은데 '이세계' 라는 것은 '다른 세계' 그러니까 작품안에서의 게임 세계다. 뭔가 철학적인 제목같은 느낌을 받았는데 전혀 아니다. 일본어 번역의 특징일 뿐. 어쨌든 조금 재미있기도 했지만 같은 이야기가 미묘하게 달라져서 반복되는데다가 이후 이야기도 비슷해서 보기를 포기했다. 약간 지치는 작품이다.</p>\n<h2>비추천4. 켄 정: 크레이지 리치 코리안의 고백</h2>\n<p><a href=\"https://www.netflix.com/title/80244853\">켄 정: 크레이지 리치 코리안의 고백</a>은 켄 정의 스탠딩 코미디다. 스탠딩 코미디를 좋아하긴 하는데 뭐랄까 현란한 말발로 웃기는 것은 좋았는데 이런 식으로 약간의 자극적인 말들도 웃기는 건 좀 별로다. 이전에 봤던 유병재도 별로 였고(최악) 앨런도 크게 재미있진 않았다. 이건 초반에 조금 보다가 불쾌해져서 더이상 볼 수 없었다.</p>\n<p>&nbsp;</p>            ","summary":"뭔가 1월에 추천작이라는 글을 쓰고 나니 2월에도 써야할 것 같아서 정리를 해보려고 한다.\n추천1. 언브레이커블 키미슈미트\n언브레이커블 키미슈미트는 2015년에 처음 시작된 시리즈인데 최근에 시즌4가 업데이트되어서 그런지 계속해서 내 추천리스트에 보였다. 그닥 관심이 없어서 안보다가 뭔가 싶어서 그냥 한번 봤는데 정주행하게 되었다.\n\n정주행을 한 이유는 이 오프닝 때문이라고 해도 과언이 아니다. 이 부분이 너무 재미있다. '인터뷰 말투가 랩같네' 라고 ","image":"https://img1.daumcdn.net/thumb/R800x0/?scode=mtistory2&fname=https%3A%2F%2Ft1.daumcdn.net%2Fcfile%2Ftistory%2F993738425C7A9DA326"}},"__N_SSG":true}