{"pageProps":{"post":{"id":"554","date":"2019. 3. 8. 09:00","title":"3월의 에버랜드","content":"<p>에버랜드는 어릴적 자연농원 시절부터 늘 좋았던 곳이다. 입구로 들어가는 순간부터 완전히 새로운 세상이 열리는 꿈같은 공간. 나에겐 에버랜드는 그런 곳이었다. 중학생 시절부터 소풍은 무조건 여기였다. 가깝기도 했고 왔을 때 아이들에게 만족도가 높아서 그랬던 것 같다.</p>\n<p><img src=\"https://t1.daumcdn.net/cfile/tistory/99DFE3445C81A4A31A\" ></p>\n<p>20대가 되어서도 에버랜드에 자주 오게 되었다. 친구와 놀러오기도 했고, 데이트를 위해서 오기도 했고, 무리들의 소풍장소로 이용되기도 했다. 부모님과 오기도 했었다. 물론 부모님은 날 위해서 이 곳을 선택하셨겠지만.</p>\n<p>어릴 적에는 적당히 즐기긴 했지만 기다란 줄에서 사람들에 치이며 몇십분 혹은 몇시간을 기다리는 일은 내게 쉽지 않은 일이었다. 그래서 그런지 오락실에서, 공원에서 많은 시간을 보냈던 기억이 있다. 30대부터는 놀이기구가 더이상 타고 싶지 않았다. 괜히 격렬한 것을 탔다가 힘들기만 했던 것 같다. 그 이후로 점점 여긴 오지 않는 곳이 되었다.</p>\n<hr>\n<p>해일이가 어린이집에 가기 싫다고 했다. 교실 앞에서 울먹울먹하면서 들어가고 싶지 않다고 했다. 어린이집에 처음 적응할 때 이후로는 한번도 이런 적이 없었다. 선생님 보러 가고 싶다던 애가 이러니 너무 놀랐다. 아무래도 선생님들이 모두 바뀌어서 의지할 곳이 없어서 힘들었던 것 같다.</p>\n<p>당장이라도 휴가를 쓰고 데리고 나오고 싶었지만 해야할 일들이 많아 그럴 순 없었다. 몇시간이라도 일찍 퇴근해서 데리고 나와야겠다고 생각했다. 그 때 에버랜드 생각이 났다. 동물도 보고 뛰어놀고 놀이기구도 타고 하면서 활짝 웃게 해주고 싶었다.</p>\n<p><img src=\"https://t1.daumcdn.net/cfile/tistory/9950AC425C81A1471B\" ></p>\n<p>그렇게 조금 일찍 어린이집을 나온 우리는 에버랜드 연간회원이 되었다. 연간회원권 목걸이로 놀이기구를 타는 줄 알았는데 많은 것이 바뀌어 있었다. 입장권이란 것이 없어졌고 모두 자유이용권이었다. 들어갈 때만 확인하고 안에서는 아무것도 확인하지 않았다. 모든 것이 프리패스다. 편했다. 내 사진이 몹시 이상했는데 다행이라고 생각했다.</p>\n<p>해일이는 아직 110cm가 안되서 재미있어보이는 놀이기구는 탈 수 없었다. 하지만 나름 애들용 놀이기구도 같이 타보니 재미있었다. 그리고 이것이 과연 애들용인가 싶을 정도로 무서운 것도 있었다. 2-3미터 가량을 위로 올라갔다가 내려왔다가 하는 무시무시한 놀이기구였다.</p>\n<p><iframe src=\"https://www.youtube.com/embed/wOn9bJoXj4o\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"\" data-opengraph-url=\"https://www.youtube.com/watch?v=wOn9bJoXj4o\" data-opengraph-image=\"https://i.ytimg.com/vi/wOn9bJoXj4o/hqdefault.jpg\" data-opengraph-title=\"%EC%97%90%EB%B2%84%EB%9E%9C%EB%93%9C%20%ED%94%8C%EB%9E%98%EC%89%AC%20%ED%8C%A1%ED%8C%A1\"></iframe>이게 그냥 보면 뭐가 무섭나 싶지만 처음 쭉 올라갈때 마이 무섭다. 하지만 해일이는 이게 너무 재미있는지 연달아 3번이나 타고 더 타자는 걸 겨우 말렸다. 다음에 가서도 이거 몇번 타면 될 것 같다. 너무너무 좋아한다. 의외로 진짜 호랑이, 사자, 곰 이런 커다란 동물에는 시큰둥하다. 회전목마도 시큰둥. 익사이팅한 걸 좋아하는 것 같다.</p>\n<p><img src=\"https://t1.daumcdn.net/cfile/tistory/99107D485C81A1941B\" ></p>\n<p>갑자기 결정한 것이 조금 걱정되긴 했지만 이틀 연달아 가 본 결과 잘 했다는 생각이다. 본격적인 행사가 시작되지 않아서 여기저기 공사 중인데도 이렇게 재미있었는데 이제 튤립축제, 물개쇼, 로스트밸리 이런거 하기 시작하면 정말 재미있을 것 같다. 일단 매주 금요일에 회사와 어린이집 안가고 여기에 가볼 예정이다. 벌써 기대된다.</p>            ","summary":"에버랜드는 어릴적 자연농원 시절부터 늘 좋았던 곳이다. 입구로 들어가는 순간부터 완전히 새로운 세상이 열리는 꿈같은 공간. 나에겐 에버랜드는 그런 곳이었다. 중학생 시절부터 소풍은 무조건 여기였다. 가깝기도 했고 왔을 때 아이들에게 만족도가 높아서 그랬던 것 같다.\n\n20대가 되어서도 에버랜드에 자주 오게 되었다. 친구와 놀러오기도 했고, 데이트를 위해서 오기도 했고, 무리들의 소풍장소로 이용되기도 했다. 부모님과 오기도 했었다. 물론 부모님은 날 위해","image":"https://img1.daumcdn.net/thumb/R800x0/?scode=mtistory2&fname=https%3A%2F%2Ft1.daumcdn.net%2Fcfile%2Ftistory%2F99DFE3445C81A4A31A"}},"__N_SSG":true}