{"pageProps":{"post":{"id":"598","date":"2020. 4. 15. 16:46","title":"Ubuntu 20.04 LTS","content":"<p>언젠가부터 우분투 업데이트에 별다른 감흥이 없어졌다. gnome2에서 unity로 넘어가려는 시도나 unity를 포기하고 gnome3로 전환하는 과정에서는 엄청난 변화가 있었는데 gnome3로 넘어온 순간부터는 UI상으로 큰 변화가 없었기 때문에 변한 부분이 잘 느껴지지 않았다. 아무래도 나라는 사람이 시각으로 많은 것이 좌지우지되다보니 그런 것 같다.</p>\n<p>최근에 20.04를 조금 기다렸던 이유는 바로 한없이 이어지는 재택근무때문이다. 재택근무에는 vpn의 사용이 거의 필수적인데 이 vpn이 우분투의 마지막 LTS버전인 18.04까지만 지원하고 있었기 때문이다. 물론 그 전 버전은 LTS가 아닌데도 지원하긴 했지만 LTS면 그대도 지원해주지 않을까 하는 희망이 있었기 때문이다. 물론 나온다고 바로 지원해주진 않겠지만. 심지어 정식 릴리즈는 23일이다. 일주일 넘게 남았다.</p>\n<p>우리 회사에서 사용하는 vpn은 pulse secure인데 로그를 보니 pulseUi 라는 프로그램이 libwebkitgtk 1.0 버전을 사용하고 있었다. 최신버전은 webkit2gtk에다 버전 4였나 그랬는데... 그래서 어떻게든 써보자는 노력은 포기하기로 했다. 그래서 회사 PC에다가는 18.04를 설치해서 사용 중이다.</p>\n<p>사설이 많이 길었다. 어쨌든 2년전에 나온 18.04를 주로 사용하게 되다보니 이 별다른 차이를 느끼지 못했던 업데이트가 굉장히 크게 느껴졌다. 창관리, 테마관리, 세부적인 설정의 디테일 들이 많이 다듬어졌구나 새삼 느꼈다. 이번 20.04에서는 약간은 크게 달라진 부분이 있다. 그건 바로 다크모드다.</p>\n<p><img src=\"https://t1.daumcdn.net/cfile/tistory/9938723F5E96B82527\" ></p>\n<p>모양 설정에 windows color라고 테마기능이 추가됐다. 이 세가지 테마는 사실 이전부터 사용할 수 있었다. gnome3 기능 개선앱에서 설정할 수 있는데 이 기능이 들어간건 아주 오래전이다. Light, Standard, Dark는 각각 Yaru-light, Yaru, Yaru-dark를 사용하도록 설정된다.</p>\n<p><img src=\"https://t1.daumcdn.net/cfile/tistory/99F1133C5E96B96F2B\" ></p>\n<p>뭔가 gnome 에서 기능은 아주 예쁘게 잘 만드는데 설정을 잘 못 만들고 우분투는 설정을 잘 만드는 느낌이다. gnome의 설정앱은 마치 개발자 앱같은 느낌, 우분투의 설정앱은 사용자 앱같은 느낌이다.</p>\n<p>우분투는 생각보다 자주 업데이트를 하고 그에 따라서 재시작도 종종 해야한다. 이번 20.04에서는 이를 livepatch라는 기능으로 해결하려고 한다.&nbsp;</p>\n<p><img src=\"https://t1.daumcdn.net/cfile/tistory/99404D375E96BA4A07\" ></p>\n<p>livepatch를 사용하기 위해서는 ubuntu one 계정을 사용해야한다. 활성화 하기위해서 그동안 쓸 일이 없어서 잊었던 계정을 찾게 되었다. ubuntu one 계정을 사용하는 것으로 보아 대상앱은 아마도 snap store 앱이 될 것 같은데 뭔가 특별한 방법을 사용한 앱만 가능할지는 모르겠다.</p>\n<hr>\n<p>18.04만 며칠 사용하다가 오랜만에 또 최신버전 사용해보니 너무 좋다. vpn 앱만 사용가능했더라도 바로 최신버전 고고 했을텐데 아쉽다. 우분투 업무용으로 너무 좋은데 왜들 다 안쓰는거야... 쩝.</p>            ","summary":"언젠가부터 우분투 업데이트에 별다른 감흥이 없어졌다. gnome2에서 unity로 넘어가려는 시도나 unity를 포기하고 gnome3로 전환하는 과정에서는 엄청난 변화가 있었는데 gnome3로 넘어온 순간부터는 UI상으로 큰 변화가 없었기 때문에 변한 부분이 잘 느껴지지 않았다. 아무래도 나라는 사람이 시각으로 많은 것이 좌지우지되다보니 그런 것 같다.\n최근에 20.04를 조금 기다렸던 이유는 바로 한없이 이어지는 재택근무때문이다. 재택근무에는 vpn의","image":"https://img1.daumcdn.net/thumb/R800x0/?scode=mtistory2&fname=https%3A%2F%2Ft1.daumcdn.net%2Fcfile%2Ftistory%2F9938723F5E96B82527"}},"__N_SSG":true}