{"pageProps":{"post":{"id":"612","date":"2021. 7. 1. 23:29","title":"이재명 20대 대통령선거 민주당 후보경선 출마선언문","content":"<p><iframe src=\"https://www.youtube.com/embed/bgHdPY2QK1g?feature=oembed\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"\" data-opengraph-url=\"https://www.youtube.com/watch?v=bgHdPY2QK1g\" data-opengraph-image=\"https://img1.daumcdn.net/thumb/S200x200/?scode=mtistory2&amp;fname=https%3A%2F%2Fi.ytimg.com%2Fvi%2FbgHdPY2QK1g%2Fhqdefault.jpg\" data-opengraph-title=\"%EC%A0%9C20%EB%8C%80%20%EB%8C%80%ED%86%B5%EB%A0%B9%EC%84%A0%EA%B1%B0%20%EB%AF%BC%EC%A3%BC%EB%8B%B9%20%ED%9B%84%EB%B3%B4%EA%B2%BD%EC%84%A0%20%EC%B6%9C%EB%A7%88%EC%84%A0%EC%96%B8\"></iframe></p>\n<p>존경하는 국민여러분! 사랑하는 당원동지 여러분!</p>\n<blockquote>\n<p>&ldquo;대한민국은 민주공화국이다.&rdquo;<br>&ldquo;대한민국의 주권은 국민에게 있고 모든 권력은 국민으로부터 나온다.&rdquo;</p>\n</blockquote>\n<p>대한민국 헌법 1조를 읽으며 두렵고 엄숙한 마음으로 20대 대통령선거 출마를 선언합니다.</p>\n<h2>국가의 존재이유</h2>\n<p>국가를 만들고 함께 사는 이유는 더 안전하고 더 나은 삶을 위해서입니다. 주권의지를 대신하는 정치는 튼튼한 안보로 국민의 생명과 안전을 지키고, 공정한 질서 위에 국민의 더 나은 삶을 일궈내야 합니다. 특권과 반칙에 기반한 강자의 욕망을 절제시키고 약자의 삶을 보듬는 억강부약 정치로 모두 함께 잘 사는 대동세상을 향해가야 합니다.</p>\n<h2>오늘의 대한민국이 위기입니다</h2>\n<p>국민의 피와 땀으로 대한민국은 선진국이 되었습니다. 우리 기성세대는 현실은 척박해도 도전할 기회가 있고, 내일은 더 나을 것이라 믿어지는 세상을 살았습니다. 그러나 오늘날 대한민국 국민의 삶은 위기를 맞고 있습니다. 취약계층이 되어버린 청년세대의 절망이 우리를 아프게 합니다. 국민의 위기는 곧 국가의 위기입니다.</p>\n<p>&lsquo;오늘은 어제보다 더 안전해졌는가. 내일은 오늘보다 더 나을 것인가&rsquo;라는 국민의 질문에 정치는 답해야 합니다. 에너지대전환과 디지털대전환이 산업경제재편 뿐 아니라 일상생활의 틀마저 바꾸도록 요구하는 것도 또 다른 위기입니다.&nbsp;</p>\n<h2>위기의 원인은 불공정과 양극화입니다</h2>\n<p>누군가의 부당이익은 누군가의 손실입니다. 강자가 규칙을 어겨 얻는 이익은 규칙을 어길 힘조차 없는 약자의 피해입니다. 투기이익 같은 불공정한 소득은 의욕을 떨어뜨리고, 불평등과 양극화를 키웁니다. 어느 때보다 더 많은 자본, 더 나은 기술, 더 훌륭한 노동력, 더 튼실한 인프라를 갖추었음에도 우리가 저성장으로 고통 받는 것은 바로 불공정과 불평등 때문입니다.</p>\n<p>불평등 양극화는 상대적 빈곤이라는 감성적 문제를 넘어, 비효율적 자원배분과 경쟁의 효율 악화로 성장동력을 훼손하고 경기침체와 저성장을 부릅니다. 저출생, 고령화, 실업, 갈등과 균열, 사교육과 입시지옥 같은 모든 문제는 저성장에 의한 기회빈곤이 주된 원인입니다.</p>\n<p>투자만 하면 고용, 소득, 소비가 늘어 경제가 선순환하던 고도성장 시대는 갔습니다. 지금은 투자할 돈은 남아돌고 성장해도 고용이 늘지 않습니다. 줄어든 기회 때문에 경쟁이 과열되고 경쟁과열은 불공정에 대한 불만을 분노로 바꿉니다. 이제 승자만 생존하는 무한경쟁 약육강식이 일상이 되었습니다.</p>\n<h2>풀 수 없는 매듭은 자르고, 길이 없는 광야에는 길을 내야 합니다.</h2>\n<p>사람이 만든 문제는 사람의 힘으로 얼마든지 해결할 수 있습니다. 정치의 요체는 이해관계 조정이기 때문에 더 많은 사람에게 더 많은 혜택이 돌아가는 개혁정책일수록 기득권 반발은 그만큼 더 큽니다.</p>\n<p>정치는 아이디어 경진대회가 아니고 정책에는 저작권이 없습니다. 수많은 정책 중에서 가장 효율적인 정책을 선택하는 것은 용기와 결단의 문제이고, 강력한 추진력이 있어야 개혁정책이 성공할 수 있습니다.</p>\n<h2>공정성 확보가 희망과 성장을 가능하게 합니다.</h2>\n<p>역사적으로 공정한 나라는 흥했고 불공정한 나라는 망했습니다. 공정한 사회에는 꿈과 열정이 넘치지만, 불공정한 사회는 좌절과 회피를 잉태합니다. 규칙을 지켜도 손해가 없고 억울한 사람도 억울한 지역도 없는 나라, 기회는 공평하고, 공정한 경쟁의 결과 합당한 보상이 주어지는 사회여야 미래가 있습니다.&nbsp;</p>\n<p>공정성 확보, 불평등과 양극화 완화, 복지확충에 더해서, 경제적기본권이 보장되어 모두가 최소한의 경제적 풍요를 누리는 사회여야 지속적 성장과 국민의 더 나은 삶이 가능합니다.</p>\n<h2>강력한 경제정책이 대전환위기를 기회로 만듭니다.</h2>\n<p>경제는 민간과 시장의 몫이지만, 대전환시대의 대대적 산업경제구조 재편은 민간기업과 시장만으로 감당하기&nbsp; 어렵습니다. 대공황시대 뉴딜처럼 대전환 시대에는 공공이 길을 내고 민간이 투자와 혁신을 감행할 수 있게 해야 합니다. 규제합리화로 기업의 창의와 혁신이 가능한 자유로운 공간을 확보해야 합니다.</p>\n<p>미래형 인적자원 육성시스템으로 기초 및 첨단 과학기술을 육성하고 문화컨텐츠 강화를 위해 문화예술 지원을 확대해야 합니다.&nbsp;대대적 인프라 확충과 강력한 산업경제 재편으로 투자기회 확대와 신성장동력을 발굴하고 새로운 일자리와 지속적 공정성장의 길을 열어야 합니다.&nbsp;</p>\n<p>반걸음 늦으면 끌려가지만, 반걸음 앞서면 위기를 기회로 활용할 수 있습니다. 전세계적 위기는 우리 경제가 과거의 고단한 추격경제에서 선도경제로 나아갈 절호의 기회입니다.&nbsp;한반도평화경제체제 수립, 대륙을 여는 북방경제활성화도 새로운 성장에 큰 힘이 될 것입니다</p>\n<h2>지금은 이재명! 이재명은 합니다!</h2>\n<p>약속을 어겨도 제재가 없는 정치에선 공약위반이 다반사이고, 그래서 정치는 불신과 조롱의 대상입니다. 전문가 몇 명이면 그럴듯한 공약은 얼마든지 만들 수 있습니다. 현재의 거울에 비친 과거가 바로 미래입니다. 누군가의 미래가 궁금하면 그의 과거를 보아야 합니다.&nbsp;</p>\n<p>저 이재명은 지킬 약속만 하고 한번 한 약속은 반드시 지켰습니다. 성남시장 8년, 경기도지사 3년 동안 공약이행률이 90%를 넘는 이유입니다.&nbsp;주권자중심의 확고한 철학과 가치, 용기와 결단, 강력한 추진력으로 저항을 이겨내며 성과로 증명했습니다.</p>\n<p>위기를 이겨온 사람만이 위기를 극복할 수 있습니다. 기회는 누구나 활용하지만, 위기를 기회로 바꾸는 것은 아무나 할 수 없는 일입니다. 위기가 더 많았던 흙수저 비주류지만 위기를 기회로 바꾸며 성과를 만들어 온 저 이재명이야말로 위기의 대한민국을 희망민국으로 바꿀 수 있습니다.</p>\n<p>&nbsp;</p>\n<p>청년배당으로 난생처음 과일을 사먹었다는 청년, 극저신용대출 덕에 다시 살아보기로 했다는 한부모 가장, 재난기본소득 때문에 가게 문을 닫지 않았다는 소상공인, 경기도의 도움으로 체불임금을 받아 행복하다는 알바청소년을 기억하겠습니다.</p>\n<p>여성들이 안전에 불안을 느끼고 차별과 경력단절 때문에 고심하지 않는 나라, 노력과 능력에 따라 개천에서도 용이 나는 나라, 죽음을 무릅쓰고 노동하지 않는 나라, 과도한 경쟁 때문에 친구를 증오하지 않아도 되는 나라, 사교육비에 부모님 허리가 휘지 않고 공교육만으로도 필요역량을 충분히 키우는 나라를 만들겠습니다.</p>\n<p>배고픔에 계란을 훔치다 투옥되는 빈민, 세계 최고의 빈곤율에 시달리며 불안한 노후에 고심하는 노인, 생활고와 빚더미로 세상을 버리는 일가족이 더 이상 뉴스에 나지 않게 하겠습니다. 불가능해 보이던 계곡불법시설을 정비한 것처럼, 실거주 주택은 더 보호하되 투기용 주택의 세금과 금융제한을 강화하고, 적정한 분양주택 공급, 그리고 충분한 기본주택 공급으로 더 이상 집 문제로 고통받지 않게 하겠습니다.</p>\n<p>&nbsp;</p>\n<p>대전환의 위기를 경제재도약의 기회로 만드는 강력한 경제부흥정책을 즉시 시작하겠습니다. 획기적인 미래형 경제산업 전환으로 양질의 일자리를 늘리고 국가재정력을 확충해 보편복지국가의 토대를 만들겠습니다. 기본소득을 도입해서, 부족한 소비를 늘려 경제를 살리고, 누구나 최소한의 경제적 풍요를 누리며 하고 싶은 일을 하는 사회를 만들겠습니다. 더 많은 문화예술체육 투자로 건강한 국민이 높은 수준의 문화예술을 만들고 즐기는 세계 속 문화강국을 만들겠습니다.</p>\n<p>충분한 사회안전망으로 해고가 두렵지 않고, 동일노동 동일임금이 보장되는 합리적 노동환경을 만들겠습니다. 빈자와 부자, 강자와 약자, 중소기업과 대기업, 정규직과 비정규직, 도시와 농어촌, 수도권과 지방 등 온갖 갈등의 영역에서 사회적대타협을 통해 균형과 상식을 회복하겠습니다. 경쟁이 끝나면 모두를 대표해야 하는 원리에 따라 실력중심의 차별 없는 인재등용으로 융성하는 새 나라를 만들겠습니다.</p>\n<p>&nbsp;</p>\n<p>한반도는 해양과 대륙 세력의 충돌로 위기와 기회가 공존합니다. 강력한 자주국방력을 바탕으로 국익중심 균형외교를 통해 평화공존과 공동번영의 새 길을 열겠습니다. 진영논리와 당리당략으로 상대의 실패와 차악 선택을 기다리는 정쟁정치가 아니라 누가 잘하나 겨루는 경쟁정치의 장을 열겠습니다.&nbsp;</p>\n<p>국민과의 약속은 반드시 지키고, 할 일은 했던 것처럼 실용적 민생개혁에 집중하여 곳곳에서 작더라도 삶을 체감적으로 바꿔가겠습니다.&nbsp;국민을 가르치는 &lsquo;지도자&rsquo;가 아닌 주권자를 대리하는 일꾼으로서 저 높은 곳이 아니라 국민 곁에 있겠습니다. 어려울 땐 언제나 맨 앞에서 상처와 책임을 감수하며 길을 열겠습니다.</p>\n<p>&nbsp;</p>\n<p>대한민국의 민주화, 외환위기 극복, 복지국가기틀 마련, 한반도평화정착이라는 역사적 성과를 만든 더불어민주당의 당원으로서 현장속에서 더 겸손하게 국민의 목소리에 귀 기울이는 더 나은 국민정당을 만들겠습니다.&nbsp;자랑스런 김대중, 노무현, 문재인 정부의 토대 위에 필요한 것은 더하고, 부족한 것은 채우며, 잘못은 고쳐 더 유능한 4기 민주당정권, 더 새로운 이재명정부로 국민 앞에 서겠습니다.</p>\n<p>존경하는 국민여러분, 정치적 후광, 조직, 돈, 연고 아무것도 없는 저를 응원하는 것은 성남시와 경기도를 이끌며 만들어낸 작은 성과와 효능감 때문일 것입니다.&nbsp;실적으로 증명된 저 이재명이 나라를 위한 준비된 역량을 발휘할 수 있게 더 큰 도구를 주십시오. 새로운 대한민국, 더 나은 국민의 삶으로 보답하겠습니다.</p>\n<p>위기의 대한민국! 지금은 이재명! 새로운 대한민국! 이재명은 합니다!</p>\n<p>감사합니다.</p>\n<p><img src=\"https://blog.kakaocdn.net/dn/cvxb94/btq8DQ9k7oM/9FLKYTI0SLopqkm1Z5lSok/img.png\" ></p>\n<hr>\n<p>드디어 이재명이 대통령 출마선언을 했다. 성남시장시절부터 지금까지 이재명을 지켜보면서 이런 사람이 정부에 필요한 사람이라는 생각을 했다. 이번 기회에 더 많은 사람들이 이재명에 대해서 알게되고 이 분이 그동안 보여준 공정함을 알게되면 좋겠다.</p>\n<p>지금의 문재인 정부도 정말 안정적으로 훌륭한 일을 해왔지만 이재명이 대통령이 되면 분명 더 살기좋은 나라가 되리라 생각한다. 비리가 사라지면 서민에게 더 많은 혜택이 온다. 그건 성남, 경기도에서 늘 봐오던 것이다.</p>            ","summary":"\n존경하는 국민여러분! 사랑하는 당원동지 여러분!\n\n&ldquo;대한민국은 민주공화국이다.&rdquo;&ldquo;대한민국의 주권은 국민에게 있고 모든 권력은 국민으로부터 나온다.&rdquo;\n\n대한민국 헌법 1조를 읽으며 두렵고 엄숙한 마음으로 20대 대통령선거 출마를 선언합니다.\n국가의 존재이유\n국가를 만들고 함께 사는 이유는 더 안전하고 더 나은 삶을 위해서입니다. 주권의지를 대신하는 정치는 튼튼한 안보로 국민의 생명과 안전을 지키고, 공정한 질서","image":"https://img1.daumcdn.net/thumb/R800x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2Fcvxb94%2Fbtq8DQ9k7oM%2F9FLKYTI0SLopqkm1Z5lSok%2Fimg.png"}},"__N_SSG":true}