{"pageProps":{"post":{"id":"616","date":"2022. 1. 16. 23:52","title":"출시 1년된 PC 2대 구입한 이야기","content":"<p>마지막으로 컴퓨터를 산적이 언제던가. 결혼하면서 구입했던 2012 late 아이맥? 아니다. 몇달 뒤 아래한글을 사용해야해서 산 다나와 표준pc? 아니다. 대학원 수업 편하게 들으라고 샀던 lenovo 노트북? 그래. 2018년에 구입했던 lenovo 노트북이 마지막이었던 것 같다.</p>\n<p>신기하게도 마지막에 구입했던 노트북만 (어처구니 없는 이유로ㅠㅠ) 메인보드가 나가서 못쓰고 있고 나머지는 아직도 문제없이 잘 사용하고 있다. pc로 대단한 게임들을 하는 것도 아니고 대부분의 개발업무도 그 컴퓨터들로 큰 문제는 없었다. (물론 개발업무는 회사 pc로 하지만 이따금 쓴다)</p>\n<p>2022년이 된 지금은... 2012 late 아이맥은 더이상 os 업그레이드가 되지를 않아 애플앱도 설치가 안된다. 다나와 표준pc는 gtx750ti로 어찌어찌 게임들을 돌려왔지만 어느 순간부터는 한계가 와서 고전게임이나 하고 있다. (아래한글용이라고 했지만 nvidia 그래픽카드를 넣은 이유)</p>\n<h2>맥미니</h2>\n<p>먼저 아들녀석 소원이라는 유투브 영상 편집도 할 겸 아이맥 대체품으로 사용할 겸 맥미니를 사기로 했다. M1칩셋이 나온지 1년이 넘었는데 이걸 왜 사냐면 그 뒤에 나온 아이맥도 M1을 사용하는데다 새로운 칩셋(아마도 M2?)은 언제 나올지 기약도 없기 때문이다. 언제 나오나 기다리며 불편하게 사느니 조금 손해보더라도 지금 행복한 선택을 하기로 했다.</p>\n<p>구매할때는 학생할인을 했는데 대략 5% 정도로 할인이 된 거 같다. 그리고 학생할인은 기계보다 소프트웨어에서 더 큰 것 같다. 동영상 편집때문에 파이널 컷을 사려고 했는데 학생할인을 받으니 파이널컷과 다른 4개의 추가 소프트웨어를 모두 20만원대에 구매할 수 있었다. 학생할인이 아니라면 파이널컷만 36만원이다.</p>\n<p>그러고보니 첫 M1 경험이다. 프로그램을 다운로드 받을때 Apple 실리콘용을 선택해야한다는 것이 뭔가 기분이 이상했다. 마인크래프트를 실행할때 로제타로 동작하는 것도 뭔가 기분이 이상했다. 너무너무 조용하다. 아무런 소리가 안난다. 팬이 분명히 돌아가는 것 같은데 아무런 소리가 안난다. 열도 안난다. 좋다.</p>\n<h2>ASUS TUF DASH</h2>\n<p>그래픽카드의 한계를 경험하고나서부터 게임을 완전히 포기했던 것 같다. 옵션을 젤 낮춰도 게임을 할 수가 없었다. 언젠가부터 게임은 유투브로 보는 것이 되어버렸다.</p>\n<p>컴퓨터를 새로 살까 싶은 때가 있었는데 갑자기 그래픽카드 품귀현상이 생겼다. 가격 조금 내리면 사야지 했는데 가격이 점점 올라가는 기현상이 생겼다. 내가 기억하는 제일 비싼 부품은 메인보드, cpu였는데 이젠 그래픽 카드 가격이 다른 모든 것을 합친 가격을 넘어섰다. pc 구매 포기!</p>\n<p>ps4를 살까 싶은 때에는 ps5 소식이 들려왔다. 조금만 기다리면 ps5가 나올것만 같았다. 조금 기다려서 ps5가 나오니까 -_- 이건 뭐 신기루같은 존재가 되었다. 사고싶어도 살 수 없는 존재였다. 뭐 되팔이를 통해서 살수야 있겠지만 2-3배 가격이었다. ps 구매 포기!</p>\n<p>그러다 갑자기 게이밍 노트북을 구매한 이유는 PC보다는 성능이 조금 떨어지겠지만 그래도 크게 부피를 차지하지도 않고 비교적 최신 칩셋을 사용할 수 있고 무엇보다도 가격이 생각보다 비싸지 않았기 때문이다.</p>\n<p>성능좋은 노트북 100만원정도면 괜찮다고 생각했는데 요즘 나오는 게이밍 노트북은 생김새도 나쁘지 않고 대부분의 고사양 게임도 동작하고 무엇보다도 다른 용도로도 충분히 사용가능하기 때문에 아주 괜찮게 보였다.</p>\n<p>구매한 ASUS TUF DASH는 그럭저럭 괜찮은 평가를 받는 제품이다. 키보드 배치나 포트구성도 맘에 들었다. 성능은... 다른 pc를 경험해보지도 못했고 그동안 느린 pc에 익숙해져서 그런지 너무너무 만족스럽다. 몇년 지난 게임이지만 레데리2의 화려한 화면을 실제로 보니 너무나 감동적이었다.</p>\n<p>놀라운 점은 내가 구매한 이후에 이 노트북은 바로 품절됐고, 가격도 올라갔다. 뭔가 싸게 사지 않았는데 싸게 산 느낌이다.&nbsp;</p>\n<hr>\n<p>주저리주저리 말이 많았다. 새로운 모델을 기다리지 않고 바로 구매한 것은 전혀 후회하지 않는다. 나를 위해 뭔가를 산적이 별로 없었는데 이번엔 나를 위한 것이었다. 그것만으로도 그냥 기분이 좋다. 이래서 다들 뭔가 그렇게 사는건가 싶다.</p>            ","summary":"마지막으로 컴퓨터를 산적이 언제던가. 결혼하면서 구입했던 2012 late 아이맥? 아니다. 몇달 뒤 아래한글을 사용해야해서 산 다나와 표준pc? 아니다. 대학원 수업 편하게 들으라고 샀던 lenovo 노트북? 그래. 2018년에 구입했던 lenovo 노트북이 마지막이었던 것 같다.\n신기하게도 마지막에 구입했던 노트북만 (어처구니 없는 이유로ㅠㅠ) 메인보드가 나가서 못쓰고 있고 나머지는 아직도 문제없이 잘 사용하고 있다. pc로 대단한 게임들을 하는 것","image":"https://t1.daumcdn.net/tistory_admin/static/images/openGraph/opengraph.png"}},"__N_SSG":true}