{"pageProps":{"post":{"id":"80","date":"2008. 6. 11. 12:50","title":"IE 8 Beta 1에 대한 소개를 듣고서...","content":"<img src=\"http://www.microsoft.com/library/media/1033/windows/images/products/winfamily/ie/ie8/logo_ie8.gif\" alt=\"IE8 Beta\"><br>\n<br><br>회사에서 IE 8 에 대한 소개를 한다고 해서 어제 잠시 들었습니다.<br><br>웹표준을 완벽하게 지켰다고 하는데..<br>웹표준을 따르게 되면 우리나라의 대부분의 웹페이지들의 레이아웃이 깨질 것이 분명한데..<br>과연 사람들이 IE 8 을 사용하게 될 것인가 의문이 들기도 했고, 정말 웹표준을 따를 것인지 궁금했습니다.<br><br>......<br><br>결론은 역시 실망스럽다는 것입니다.<br>물론 IE 8은 IE 7의 극악무도한 느린 퍼포먼스를 해결하고 완벽한 <span style=\"font-weight: bold;\">표준모드</span>를 기본으로 채택했다고 합니다. 매우 잘한 일입니다.<br>그러나!!<br>이 말이 중요합니다. 표준모드라는 것은... 비표준모드도 존재한다는 뜻?<br>맞습니다. 비표준모드도 동작합니다. 사용자가 선택할 수도 있고, 심지어 웹서비스 제공자가 선택할 수도 있습니다. 바로바로바로 메타 태그를 사용하는 방법입니다.<br><br>이런게 되면 문제가 생길 수 있습니다.<br>자! 제가 비표준 웹페이지를 만들어 서비스 하고 있습니다.<br>그런데 그동안 제 페이지를 잘 보여주던 MS의 IE가 새로운 IE8에서 표준모드를 기본으로 채택하면서 제 페이지가 더이상 잘 보이지 않습니다. 모든 페이지를 표준에 적합하게 변경해야하는 위기에 처했습니다.<br>그러나 <br><blockquote>&lt;meta http-equiv=\"X-UA-COMPATIBLE\" Content=\"IE=8\"&gt;</blockquote>이라는 메타태그를 각 페이지에 삽입함으로 IE8가 기존 IE6모드인 쿽모드(이렇게 부르더군요)로 동작하도록 할 수 있습니다.<br><br>저는 어떤 방법을 선택할까요? 대부분의 사람들이 IE를 쓰는 우리나라에서 메타태그를 넣는 간단한 방법과 모든 페이지를 표준에 맞게 재 설계하는 방법 중 어느 것을 선택하겠느냐는 말입니다.<br><br>결국 많은 웹 페이지는 아무생각없이 비정상적으로 만들어질 것이고,<br>웹 개발자들은 메타태그에 IE8을 이전모드로 동작하게하는 태그를 반드시 넣게될 겁니다.<br><br>자! 의문이 들지 않을 수가 없습니다. MS가 웹표준을 준수하기 위해 IE8을 만든 것이 되는건가요, 아니면 MS가 다른 더 좋은 브라우저들(Firefox, Safari, Opera 등)을 견제하고 더이상 욕을 먹지않기 위해 (여전히 비표준모드도 잘 동작하는) 브라우저 하나 만든것이 되는 건가요?<br><br>웹 개발자는 이전 IE 사용자를 위해서 IE Hack은 여전히 써야할 것이고 우리나라의 황당한 웹페이지들을 만드는 사람들은 여전히 웹표준을 지켜야할 이유를 모를겁니다.<br>그리고 MS는 자신들의 소위 뛰어난 브라우저 IE8을 차기 OS에 또 기본 브라우저로 끼워넣겠죠.<br><br><br>물론 IE8은 눈에 띄는 새로운 기능들(Web Slices, Activity, AJAX Navigation 등)도 많이 있고, 좋아지긴 했습니다만 그 모든 것이 Windows를 사용하도록 하는데에 초점이 맞춰져 있다는 것은 非Windows 사용자로서 별로 달가운 일이 아닙니다.<br><br><br><br>            ","summary":"\n회사에서 IE 8 에 대한 소개를 한다고 해서 어제 잠시 들었습니다.웹표준을 완벽하게 지켰다고 하는데..웹표준을 따르게 되면 우리나라의 대부분의 웹페이지들의 레이아웃이 깨질 것이 분명한데..과연 사람들이 IE 8 을 사용하게 될 것인가 의문이 들기도 했고, 정말 웹표준을 따를 것인지 궁금했습니다.......결론은 역시 실망스럽다는 것입니다.물론 IE 8은 IE 7의 극악무도한 느린 퍼포먼스를 해결하고 완벽한 표준모드를 기본으로 채택했다고 합니다. 매우","image":"https://t1.daumcdn.net/tistory_admin/static/images/openGraph/opengraph.png"}},"__N_SSG":true}